jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/


/**
 * \file     tle9563.h
 *
 * \brief    tle9563 low level access library
 *
 * \version  V0.2.4
 * \date     22. Mar 2022
 *
 * \note 
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** JO           Julia Ott                                                     **
** BG           Blandine Guillot                                              **
** VO           Vanessa Ongaro                                                **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.1.0: 2021-12-06, VO:   Initial version                                  **
** V0.1.1: 2022-01-05, VO:   [EP-994] first version of cyclic task fkt, error **
**                           handling fkt and watchdog serve fkt              **
**                           Adjusted bitfield fkts for use in  cyclic task   **
**                           Use local variable to return success             **
**                           Replaced (void *)0 with NULL                     **
**                           Added error codes for pdma and device errors     **
**                           Added return value for init fkt, cyclic task and **
**                           error handling fkt                               **
** V0.1.2: 2022-01-19, VO:   [EP-994] Cyclic task polls status of PDMA instead**
**                           of using an interrupt for PDMA completion        **
**                           Deleted commented out lines and added briefs     **
** V0.1.3: 2022-01-26, VO:   [EP-994] Updated fkts for use in cyclic task     **
**                           with new concept: cyclic update of status        **
**                           registers and return values of get fkts from     **
**                           register RAM copy                                **
**                           Removed Modify and Mask fkts                     **
**                           Added fkts to set complete registers and         **
**                           according fkt pointer type, to be used in init   **
**                           Adjusted device driver struct                    **
**                           Adjusted device driver cyclic task               **
**                           Added arrays with fkts for cyclic update, to be  **
**                           used in device driver cyclic task                **
**                           Adjusted init fkt to use fkt which set complete  **
**                           registers                                        **
** V0.1.4: 2022-01-26, VO:   All watchdog funktions which write to WD_CTRL    **
**                           register adjust parity bit                       **
** V0.1.5: 2022-02-02, VO:   Removed call of cyclic task inside 'TLE9563_set' **
**                           functions                                        **
**                           Moved init of WD Ctrl register to end of init    **
**                           routine                                          **
** V0.1.6: 2022-02-07, VO:   [EP-1003] Added function and enum to configure   **
**                           HB MODE control register with only one single    **
**                           SPI write command                                **
**                           Adjusted set bitfield functions to mask bits     **
**                           Added resetLastSetBitfieldRequest() function     **
**                           Added functions to get individual bits of SIF    **
**                           Updated briefs                                   **
** V0.1.7: 2022-02-08, VO:   [EP-994] Adjusted cyclic task to send out SPI    **
**                           msg on every call, if not busy. Adjusted resturn **
**                           value and error log accordingly                  **
**                           Adjusted Init fct according to changes in cyclic **
**                           task                                             **
** V0.1.8: 2022-02-10, VO:   [EP-994] Added comment about return value of     **
**                           cyclic task                                      **
** V0.1.9: 2022-02-11, VO:   [EP-994] Corrected comments of en/dis functions  **
** V0.2.0: 2022-02-16, VO:   [EP-1036] Added get function to get full status  **
**                           and control regsiters                            **
** V0.2.1: 2022-02-16, VO:   [EP-1037] Added comments to set device mode      **
**                           Changed init order of HS_CTRL and PWM_CTRL       **
**                           according to datasheet recommendation            **
** V0.2.2: 2022-02-18, VO:   [EP-1039] Added first status register read out   **
**                           to init routine, WD init moved to end of init to **
**                           close WD long open window at end of init         **
**                           Updated Init func with meaningful check for SPI  **
**                           errors                                           **
** V0.2.3: 2022-03-09, VO:   [EP-1038] updated main and systick               **
** V0.2.4: 2022-03-22, VO:   [EP-1038] removed TLE9563_setWdChecksumBit       **
*******************************************************************************/

