jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
#ifndef _TLE9563_H
#define _TLE9563_H

/** \addtogroup TLE9563_FUNCLAYER_api
 *  @{
 */

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "TLE9563.h"
#include "TLE9563_RegLayer.h"
#include "TLE9563_CommLayer.h"
#include "TLE9563_defines.h"
   
/*******************************************************************************
**                          Global Macro Declarations                         **
*******************************************************************************/
#define TLE9563_DEVICEDRIVER_STATUS_INIT                0
#define TLE9563_DEVICEDRIVER_STATUS_CYCLIC_UPDATE       1

#define TLE9563_DEVICEDRIVER_ERRORLOG_INIT              0
#define TLE9563_DEVICEDRIVER_ERRORLOG_STARTED           1
#define TLE9563_DEVICEDRIVER_ERRORLOG_BUSY              2
#define TLE9563_DEVICEDRIVER_ERRORLOG_SPI_RECEIVE_ERR   3

#define TLE9563_DEVICEDRIVER_CYCLICSTATUPDATENUM       19

/*******************************************************************************
**                          Global Type Declarations                          **
*******************************************************************************/
/** \enum tDEVICE_mode
 *  \brief Enum for the TLE9563 Device Mode Control
 */
typedef enum _tDEVICE_mode
{
  DEVICE_mode_normal = 0,                                   /** \brief  Normal Mode */
  DEVICE_mode_sleep = 1,                                    /** \brief  Sleep Mode */
  DEVICE_mode_stop = 2,                                     /** \brief  Stop Mode */
  DEVICE_mode_reset = 3                                     /** \brief  Device reset Soft reset is executed (configuration of RSTN triggering in bit SOFT_RESET_RO) */
} tDEVICE_mode;

/** \enum tVCC1_overVoltReact
 *  \brief Enum for the TLE9563 Reaction in case of VCC1 Over Voltage
 */
typedef enum _tVCC1_overVoltReact
{
  VCC1_overVoltReact_no = 0,                                /** \brief  no reaction */
  VCC1_overVoltReact_intn = 1,                              /** \brief  INTN event is generated */
  VCC1_overVoltReact_rstn = 2,                              /** \brief  RSTN event is generated */
  VCC1_overVoltReact_failsafe = 3                           /** \brief  Fail-Safe Mode is entered */
} tVCC1_overVoltReact;

/** \enum tVCC1_underVoltResetHys
 *  \brief Enum for the TLE9563 VCC1 Undervoltage Reset Hysteresis Selection (see also Chapter 12.7.1 for more information)
 */
typedef enum _tVCC1_underVoltResetHys
{
  VCC1_underVoltResetHys_default = 0,                       /** \brief  default hysteresis applies as specified in the electrical characteristics table */
  VCC1_underVoltResetHys_highest = 1                        /** \brief  the highest rising threshold (VRT1,R) is always used for the release of the undervoltage reset */
} tVCC1_underVoltResetHys;

/** \enum tVCC1_actPeakThresh
 *  \brief Enum for the TLE9563 VCC1 Active Peak Threshold Selection
 */
typedef enum _tVCC1_actPeakThresh
{
  VCC1_actPeakThresh_low = 0,                               /** \brief  low VCC1 active peak threshold selected */
  VCC1_actPeakThresh_high = 1                               /** \brief  high VCC1 active peak threshold selected */
} tVCC1_actPeakThresh;

/** \enum tVCC1_resetThresh
 *  \brief Enum for the TLE9563 VCC1 Reset Threshold Control
 */
typedef enum _tVCC1_resetThresh
{
  VCC1_resetThresh_vrt1 = 0,                                /** \brief  Vrt1 selected (highest threshold) */
  VCC1_resetThresh_vrt2 = 1,                                /** \brief  Vrt2 selected */
  VCC1_resetThresh_vrt3 = 2,                                /** \brief  Vrt3 selected */
  VCC1_resetThresh_vrt4 = 3                                 /** \brief  Vrt4 selected */
} tVCC1_resetThresh;

/** \enum tTSD2_minWaitTime
 *  \brief Enum for the TLE9563 TSD2 minimum Waiting Time Selection
 */
typedef enum _tTSD2_minWaitTime
{
  TSD2_minWaitTime_1s = 0,                                  /** \brief  Minimum waiting time until TSD2 is released again is always 1 s */
  TSD2_minWaitTime_64s = 1                                  /** \brief  Minimum waiting time until TSD2 is released again is 1 s, after >16 TSD2 consecutive events, it will extended x 64 */
} tTSD2_minWaitTime;

/** \enum tVS_overVoltThresh
 *  \brief Enum for the TLE9563 VS OV comparator threshold change
 */
typedef enum _tVS_overVoltThresh
{
  VS_overVoltThresh_20v = 0,                                /** \brief  Default threshold setting (VS,OVD1) */
  VS_overVoltThresh_30v = 1                                 /** \brief  increased threshold setting (VS,OVD2) */
} tVS_overVoltThresh;

/** \enum tRST_delayTime
 *  \brief Enum for the TLE9563 Reset delay time
 */
typedef enum _tRST_delayTime
{
  RST_delayTime_10ms = 0,                                   /** \brief  Reset delay time 10 ms (tRD1) */
  RST_delayTime_2ms = 1                                     /** \brief  Reset delay time to 2 ms (tRD2) */
} tRST_delayTime;

/** \enum tSOFTRST_config
 *  \brief Enum for the TLE9563 Soft Reset Configuration
 */
typedef enum _tSOFTRST_config
{
  SOFTRST_config_rstn = 0,                                  /** \brief  RSTN will be triggered (pulled low) during a Soft Reset */
  SOFTRST_config_norstn = 1                                 /** \brief  no RSTN trigger during a Soft Reset */
} tSOFTRST_config;

/** \enum tWD_config
 *  \brief Enum for the TLE9563 Watchdog Configuration
 */
typedef enum _tWD_config
{
  WD_config_timeout = 0,                                    /** \brief  Watchdog works as a Time-Out watchdog */
  WD_config_window = 1                                      /** \brief  Watchdog works as a Window watchdog */
} tWD_config;

/** \enum tWD_timerPeriod
 *  \brief Enum for the TLE9563 Watchdog Timer Period
 */
typedef enum _tWD_timerPeriod
{
  WD_timerPeriod_10ms = 0,                                  /** \brief  10ms */
  WD_timerPeriod_20ms = 1,                                  /** \brief  20ms */
  WD_timerPeriod_50ms = 2,                                  /** \brief  50ms */
  WD_timerPeriod_100ms = 3,                                 /** \brief  100ms */
  WD_timerPeriod_200ms = 4,                                 /** \brief  200ms */
  WD_timerPeriod_500ms = 5,                                 /** \brief  500ms */
  WD_timerPeriod_1s = 6,                                    /** \brief  1s */
  WD_timerPeriod_10s = 7                                    /** \brief  10s */
} tWD_timerPeriod;

