jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/** \enum tCAN_mode
 *  \brief Enum for the TLE9563 HS-CAN Module Modes
 */
typedef enum _tCAN_mode
{
  CAN_mode_off = 0,                                         /** \brief  CAN OFF */
  CAN_mode_wake = 1,                                        /** \brief  CAN is wake capable (no SWK) */
  CAN_mode_receive = 2,                                     /** \brief  CAN Receive Only Mode (no SWK) */
  CAN_mode_normal = 3,                                      /** \brief  CAN Normal Mode (no SWK) */
  CAN_mode_wakeswk = 5,                                     /** \brief  CAN is wake capable with SWK */
  CAN_mode_receiveswk = 6,                                  /** \brief  CAN Receive Only Mode with SWK */
  CAN_mode_normalswk = 7                                    /** \brief  CAN Normal Mode with SWK */
} tCAN_mode;

/** \enum tWK_filtTime
 *  \brief Enum for the TLE9563 Wake-up Filter Time Configuration
 */
typedef enum _tWK_filtTime
{
  WK_filtTime_16us = 0,                                     /** \brief  Filter with 16 i.ts filter time (static sensing)  */
  WK_filtTime_64us = 1,                                     /** \brief  Filter with 64 i.ts filter time (static sensing)  */
  WK_filtTime_timer1 = 2,                                   /** \brief  Filtering at the end of the on-time; filter */
  WK_filtTime_timer2 = 3,                                   /** \brief  Filtering at the end of the on-time; filter */
  WK_filtTime_sync = 4,                                     /** \brief  Filter at the end of settle time (80 i.ts), filter time of 16 i.ts (cyclic sensing) is selected, SYNC1)2)  */
} tWK_filtTime;

/** \enum tWK_pullUpPullDown
 *  \brief Enum for the TLE9563 WKx Pull-Up/Pull-Down Configuration
 */
typedef enum _tWK_pullUpPullDown
{
  WK_pullUpPullDown_no = 0,                                 /** \brief  No pull-up/pull-down selected */
  WK_pullUpPullDown_pulldown = 1,                           /** \brief  Pull-down resistor selected */
  WK_pullUpPullDown_pullup = 2,                             /** \brief  Pull-up resistor selected3) */
  WK_pullUpPullDown_auto = 3                                /** \brief  Automatic switching to pull-up or pull-down */
} tWK_pullUpPullDown;

/** \enum tTIMER_onTime
 *  \brief Enum for the TLE9563 Timer2 On-Time Configuration
 */
typedef enum _tTIMER_onTime
{
  TIMER_onTime_offlow = 0,                                  /** \brief  OFF / Low (timer not running, HSx output is low) */
  TIMER_onTime_100us = 1,                                   /** \brief  0.1ms on-time */
  TIMER_onTime_300us = 2,                                   /** \brief  0.3ms on-time */
  TIMER_onTime_1ms = 3,                                     /** \brief  1.0ms on-time */
  TIMER_onTime_10ms = 4,                                    /** \brief  10ms on-time */
  TIMER_onTime_20ms = 5,                                    /** \brief  20ms on-time */
  TIMER_onTime_offhigh = 6,                                 /** \brief  OFF / HIGH (timer not running, HSx */
  TIMER_onTime_ = 7                                         /** \brief  reserved, same behaviour as 110B */
} tTIMER_onTime;

/** \enum tTIMER_period
 *  \brief Enum for the TLE9563 Timer2 Period Configuration
 */
typedef enum _tTIMER_period
{
  TIMER_period_10ms = 0,                                    /** \brief  10ms */
  TIMER_period_20ms = 1,                                    /** \brief  20ms */
  TIMER_period_50ms = 2,                                    /** \brief  50ms */
  TIMER_period_100ms = 3,                                   /** \brief  100ms */
  TIMER_period_200ms = 4,                                   /** \brief  200ms */
  TIMER_period_500ms = 5,                                   /** \brief  500ms */
  TIMER_period_1s = 6,                                      /** \brief  1s */
  TIMER_period_2s = 7                                       /** \brief  2s */
} tTIMER_period;

/** \enum tTIMER_cyclicWk
 *  \brief Enum for the TLE9563 Cyclic Wake Configuration
 */
typedef enum _tTIMER_cyclicWk
{
  TIMER_cyclicWk_disabled = 0,                              /** \brief  Timer1 and Timer2 disabled as wake-up sources */
  TIMER_cyclicWk_timer1 = 1,                                /** \brief  Timer1 is enabled as wake-up source (Cyclic Wake) */
  TIMER_cyclicWk_timer2 = 2,                                /** \brief  Timer2 is enabled as wake-up source (Cyclic Wake) */
  TIMER_cyclicWk_ = 3                                       /** \brief  reserved */
} tTIMER_cyclicWk;

/** \enum tHS_vsOverVoltRecovery
 *  \brief Enum for the TLE9563 Switch recovery after removal of VS Overvoltage for HS3
 */
typedef enum _tHS_vsOverVoltRecovery
{
  HS_vsOverVoltRecovery_disabled = 0,                       /** \brief  Switch recovery is disabled */
  HS_vsOverVoltRecovery_previous = 1                        /** \brief  Previous state before VS Overvoltage is enabled after Overvoltage considtion is removed */
} tHS_vsOverVoltRecovery;

/** \enum tHS_vsUnderVoltRecovery
 *  \brief Enum for the TLE9563 Switch recovery after removal of Undervoltage for HSx
 */
typedef enum _tHS_vsUnderVoltRecovery
{
  HS_vsUnderVoltRecovery_disabled = 0,                      /** \brief  Switch recovery is disabled */
  HS_vsUnderVoltRecovery_previous = 1                       /** \brief  Previous state before VS */
} tHS_vsUnderVoltRecovery;

/** \enum tHS_config
 *  \brief Enum for the TLE9563 HS3 Configuration
 */
typedef enum _tHS_config
{
  HS_config_off = 0,                                        /** \brief  OFF */
  HS_config_on = 1,                                         /** \brief  ON */
  HS_config_timer1 = 2,                                     /** \brief  Controlled by Timer1 */
  HS_config_timer2 = 3,                                     /** \brief  Controlled by Timer2 */
  HS_config_pwm1 = 4,                                       /** \brief  Controlled by PWM1 */
  HS_config_pwm2 = 5,                                       /** \brief  Controlled by PWM2 */
  HS_config_pwm3 = 6,                                       /** \brief  Controlled by PWM3 */
  HS_config_pwm4 = 7,                                       /** \brief  Controlled by PWM4 */
  HS_config_wk4sync = 8                                     /** \brief  Synchronized with WK4/SYNC */
} tHS_config;

