jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/** \enum tPWM_freq
 *  \brief Enum for the TLE9563 PWM generator Frequency Setting
 */
typedef enum _tPWM_freq
{
  PWM_freq_100hz = 0,                                       /** \brief  100Hz is selected */
  PWM_freq_200hz = 1                                        /** \brief  200Hz is selected */
} tPWM_freq;

/** \enum tBDRV_freq
 *  \brief Enum for the TLE9563 Bridge driver synchronization frequency
 */
typedef enum _tBDRV_freq
{
  BDRV_freq_18mhz = 0,                                      /** \brief  typ. 18.75 MHz (default) */
  BDRV_freq_37mhz = 1                                       /** \brief  typ. 37.5 MHz */
} tBDRV_freq;

/** \enum tCP_underVoltThresh
 *  \brief Enum for the TLE9563 Charge pump under voltage (referred to VS)
 */
typedef enum _tCP_underVoltThresh
{
  CP_underVoltThresh_th1 = 0,                               /** \brief  (default) CPUV threshold 1 for FET_LVL = 0, CPUV threshold 1 for FET_LVL = 1 */
  CP_underVoltThresh_th2 = 1                                /** \brief  CPUV threshold 2 for FET_LVL = 0, CPUV threshold 2 for FET_LVL = 1 */
} tCP_underVoltThresh;

/** \enum tBDRV_extMosfetLvl
 *  \brief Enum for the TLE9563 External MOSFET normal / logic level selection
 */
typedef enum _tBDRV_extMosfetLvl
{
  BDRV_extMosfetLvl_logic = 0,                              /** \brief  Logic level MOSFET selected */
  BDRV_extMosfetLvl_normal = 1                              /** \brief  Normal level MOSFET selected(default) */
} tBDRV_extMosfetLvl;

/** \enum tBDRV_preChargePreDischargeCurAdaption
 *  \brief Enum for the TLE9563 Adaptation of the pre-charge and pre-discharge current
 */
typedef enum _tBDRV_preChargePreDischargeCurAdaption
{
  BDRV_preChargePreDischargeCurAdaption_1step = 0,          /** \brief  1 current step (default) */
  BDRV_preChargePreDischargeCurAdaption_2steps = 1          /** \brief  2 current steps */
} tBDRV_preChargePreDischargeCurAdaption;

/** \enum tBDRV_adaptGateCtrl
 *  \brief Enum for the TLE9563 Adaptive gate control
 */
typedef enum _tBDRV_adaptGateCtrl
{
  BDRV_adaptGateCtrl_inactive1 = 0,                         /** \brief  (default) Adaptive gate control disabled, pre-charge and pre-discharge disabled */
  BDRV_adaptGateCtrl_inactive2 = 1,                         /** \brief  Adaptive gate control disabled, precharge is enabled with IPRECHG = IPCHGINIT, predischarge is  enabled with IPREDCHG = IPDCHGINIT */
  BDRV_adaptGateCtrl_active = 2,                            /** \brief  Adaptive gate control enabled, IPRECHG and IPREDCHG are self adapted */
  BDRV_adaptGateCtrl_reserved = 3                           /** \brief  Adaptive gate control enabled, IPRECHG and IPREDCHG are self adapted */
} tBDRV_adaptGateCtrl;

/** \enum tBDRV_holdCur
 *  \brief Enum for the TLE9563 Gate driver hold current IHOLD
 */
typedef enum _tBDRV_holdCur
{
  BDRV_holdCur_th1 = 0,                                     /** \brief  (default) Charge 'CHG15, discharge 'DCHG15. */
  BDRV_holdCur_th2 = 1                                      /** \brief  Charge 'CHG20, discharge 'DCHG20 */
} tBDRV_holdCur;

/** \enum tBDRV_numberOfPwmInputs
 *  \brief Enum for the TLE9563 Selection of 3 or 6 PWM inputs
 */
typedef enum _tBDRV_numberOfPwmInputs
{
  BDRV_numberOfPwmInputs_3pwm = 0,                          /** \brief  3 PWM inputs (default) */
  BDRV_numberOfPwmInputs_6pwm = 1                           /** \brief  6 PWM inputs */
} tBDRV_numberOfPwmInputs;

/** \enum tCSA_cap
 *  \brief Enum for the TLE9563 Capacitance connected to the current sense amplifier output (CCSO), see also Chapter 12.12.4
 */
typedef enum _tCSA_cap
{
  CSA_cap_400pf = 0,                                        /** \brief  CCSO < 400 pF (default) */
  CSA_cap_2nf = 1                                           /** \brief  400 pF < CCSO < 2.2 nF */
} tCSA_cap;

/** \enum tCSA_dir
 *  \brief Enum for the TLE9563 Direction of the current sense amplifier
 */
typedef enum _tCSA_dir
{
  CSA_dir_uni = 0,                                          /** \brief  Unidirectional */
  CSA_dir_bi = 1                                            /** \brief  Bidirectional (default) */
} tCSA_dir;

/** \enum tCSA_overCurFiltTime
 *  \brief Enum for the TLE9563 Overcurrent filter time of CSO
 */
typedef enum _tCSA_overCurFiltTime
{
  CSA_overCurFiltTime_6us = 0,                              /** \brief  6 us (default) */
  CSA_overCurFiltTime_10us = 1,                             /** \brief  10 us */
  CSA_overCurFiltTime_50us = 2,                             /** \brief  50 us */
  CSA_overCurFiltTime_100us = 3                             /** \brief  100 us */
} tCSA_overCurFiltTime;

/** \enum tCSA_overCurThresh
 *  \brief Enum for the TLE9563 Overcurrent detection threshold of CSO
 */
typedef enum _tCSA_overCurThresh
{
  CSA_overCurThresh_th1 = 0,                                /** \brief  VCSO > VCC1/2+2 x VCC1/20 or VCSOx< VCC1/2- 2x VCC1/20 (default) */
  CSA_overCurThresh_th2 = 1,                                /** \brief  VCSO > VCC1/2+ 4x VCC1/20 or VCSOx< VCC1/2- 4x VCC1/20 */
  CSA_overCurThresh_th3 = 2,                                /** \brief  VCSO > VCC1/2+ 5 x VCC1/20 or VCSOx< VCC1/2- 5 xVCC1/20 */
  CSA_overCurThresh_th4 = 3                                 /** \brief  VCSO > VCC1/2+ 6x VCC1/20 or VCSOx< VCC1/2- 6x VCC1/20 */
} tCSA_overCurThresh;

/** \enum tCSA_gain
 *  \brief Enum for the TLE9563 Gain of the current sense amplifier
 */
typedef enum _tCSA_gain
{
  CSA_gain_10vv = 0,                                        /** \brief  GDIFF10 (default) */
  CSA_gain_20vv = 1,                                        /** \brief  GDIFF20 */
  CSA_gain_40vv = 2,                                        /** \brief  GDIFF40 */
  CSA_gain_60vv = 3                                         /** \brief  GDIFF60 */
} tCSA_gain;

/** \enum tVDS_filtTime
 *  \brief Enum for the TLE9563 Filter time of drain-source voltage monitoring
 */
typedef enum _tVDS_filtTime
{
  VDS_filtTime_500ns = 0,                                   /** \brief  0.5 us (default) */
  VDS_filtTime_1us = 1,                                     /** \brief  1 us */
  VDS_filtTime_2us = 2,                                     /** \brief  2 us */
  VDS_filtTime_6us = 3                                      /** \brief  6 us */
} tVDS_filtTime;

