jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/** \enum tVDS_lsOverVoltThresh
 *  \brief Enum for the TLE9563 LS3 drain-source overvoltage threshold
 */
typedef enum _tVDS_lsOverVoltThresh
{
  VDS_lsOverVoltThresh_160mv = 0,                           /** \brief  0.16 V */
  VDS_lsOverVoltThresh_200mv = 1,                           /** \brief  0.20 V (default) */
  VDS_lsOverVoltThresh_300mv = 2,                           /** \brief  0.30 V */
  VDS_lsOverVoltThresh_400mv = 3,                           /** \brief  0.40 V */
  VDS_lsOverVoltThresh_500mv = 4,                           /** \brief  0.50 V */
  VDS_lsOverVoltThresh_600mv = 5,                           /** \brief  0.60 V */
  VDS_lsOverVoltThresh_800mv = 6,                           /** \brief  0.80 V */
  VDS_lsOverVoltThresh_2v = 7                               /** \brief  2.0 V */
} tVDS_lsOverVoltThresh;

/** \enum tVDS_hsOverVoltThresh
 *  \brief Enum for the TLE9563 HS3 drain-source overvoltage threshold
 */
typedef enum _tVDS_hsOverVoltThresh
{
  VDS_hsOverVoltThresh_160mv = 0,                           /** \brief  0.16 V */
  VDS_hsOverVoltThresh_200mv = 1,                           /** \brief  0.20 V (default) */
  VDS_hsOverVoltThresh_300mv = 2,                           /** \brief  0.30 V */
  VDS_hsOverVoltThresh_400mv = 3,                           /** \brief  0.40 V */
  VDS_hsOverVoltThresh_500mv = 4,                           /** \brief  0.50 V */
  VDS_hsOverVoltThresh_600mv = 5,                           /** \brief  0.60 V */
  VDS_hsOverVoltThresh_800mv = 6,                           /** \brief  0.80 V */
  VDS_hsOverVoltThresh_2v = 7                               /** \brief  2.0 V */
} tVDS_hsOverVoltThresh;

/** \enum tBDRV_hb3Mode
 *  \brief Enum for the TLE9563 Half-bridge 3 MODE selection
 */
typedef enum _tBDRV_hb3Mode
{
  BDRV_hb3Mode_passiveoff = 0,                              /** \brief  LS3 and HS3 are off by passive discharge (default) */
  BDRV_hb3Mode_ls3on = 1,                                   /** \brief  LS3 is ON */
  BDRV_hb3Mode_hs3on = 2,                                   /** \brief  HS3 is ON */
  BDRV_hb3Mode_activeoff = 3                                /** \brief  LS3 and HS3 kept off by the active discharge */
} tBDRV_hb3Mode;

/** \enum tBDRV_hb2Mode
 *  \brief Enum for the TLE9563 Half-bridge 2 MODE selection
 */
typedef enum _tBDRV_hb2Mode
{
  BDRV_hb2Mode_passiveoff = 0,                              /** \brief  LS2 and HS2 are off by passive discharge (default) */
  BDRV_hb2Mode_ls2on = 1,                                   /** \brief  LS2 is ON */
  BDRV_hb2Mode_hs2on = 2,                                   /** \brief  HS2 is ON */
  BDRV_hb2Mode_activeoff = 3                                /** \brief  LS2 and HS2 kept off by the active discharge */
} tBDRV_hb2Mode;

/** \enum tBDRV_hb1Mode
 *  \brief Enum for the TLE9563 Half-bridge 1 MODE selection
 */
typedef enum _tBDRV_hb1Mode
{
  BDRV_hb1Mode_passiveoff = 0,                              /** \brief  LS1 and HS1 are off by passive discharge (default) */
  BDRV_hb1Mode_ls1on = 1,                                   /** \brief  LS1 is ON */
  BDRV_hb1Mode_hs1on = 2,                                   /** \brief  HS1 is ON */
  BDRV_hb1Mode_activeoff = 3                                /** \brief  LS1 and HS1 kept off by the active discharge */
} tBDRV_hb1Mode;

/** \enum tBDRV_maxChargeCur
 *  \brief Enum for the TLE9563 Maximum drive current of HB3 during the pre-charge and pre-discharge phases1)
 */
typedef enum _tBDRV_maxChargeCur
{
  BDRV_maxChargeCur_31ma = 0,                               /** \brief  charge ICHG24 typ. 31.6 mA, discharge IDCHG24 typ. 30.9 mA (default) */
  BDRV_maxChargeCur_52ma = 1,                               /** \brief  charge ICHG32 typ. 52.5 mA, discharge IDCHG32 typ. 51.5 mA */
  BDRV_maxChargeCur_112ma = 2,                              /** \brief  charge ICHG52 typ. 112.2mA, discharge IDCHG52 typ. 110.8 mA */
  BDRV_maxChargeCur_150ma = 3                               /** \brief  charge ICHG63 typ. 150 mA, discharge IDCHG63 typ. 150 mA */
} tBDRV_maxChargeCur;

/** \enum tVDS_overVoltThreshLsBrake
 *  \brief Enum for the TLE9563 VDS Overvoltage for LS1-3 during braking
 */
typedef enum _tVDS_overVoltThreshLsBrake
{
  VDS_overVoltThreshLsBrake_800mv = 0,                      /** \brief  VVDSMONTH0_BRAKE, 0.8 V, typ. (default) */
  VDS_overVoltThreshLsBrake_220mv = 1                       /** \brief  VVDSMONTH1_BRAKE, 0.22 V typ. */
} tVDS_overVoltThreshLsBrake;

/** \enum tVDS_overVoltBlankTimeBrake
 *  \brief Enum for the TLE9563 Blank time of VDS overvoltage during braking
 */
typedef enum _tVDS_overVoltBlankTimeBrake
{
  VDS_overVoltBlankTimeBrake_7us = 0,                       /** \brief  tBLK_BRAKE1,7 us typ. */
  VDS_overVoltBlankTimeBrake_11us = 1                       /** \brief  tBLK_BRAKE2, 11 us typ. (default) */
} tVDS_overVoltBlankTimeBrake;

/** \enum tVS_overVoltThreshBrake
 *  \brief Enum for the TLE9563 Overvoltage brake threshold
 */
typedef enum _tVS_overVoltThreshBrake
{
  VS_overVoltThreshBrake_27v = 0,                           /** \brief  typ. 27V (default) */
  VS_overVoltThreshBrake_28v = 1,                           /** \brief  typ. 28V */
  VS_overVoltThreshBrake_29v = 2,                           /** \brief  typ. 29V */
  VS_overVoltThreshBrake_30v = 3,                           /** \brief  typ. 30V */
  VS_overVoltThreshBrake_31v = 4,                           /** \brief  typ. 31V */
  VS_overVoltThreshBrake_32v = 5,                           /** \brief  typ. 32V */
  VS_overVoltThreshBrake_33v = 6,                           /** \brief  typ. 33V */
  VS_overVoltThreshBrake_34v = 7                            /** \brief  typ. 34V */
} tVS_overVoltThreshBrake;

/** \enum tSWK_remoteTransReq
 *  \brief Enum for the TLE9563 Remote Transmission Request Field (acc. ISO11898-22016)
 */
typedef enum _tSWK_remoteTransReq
{
  SWK_remoteTransReq_normal = 0,                            /** \brief  Normal Data Frame */
  SWK_remoteTransReq_remote = 1                             /** \brief  Remote Transmission Request */
} tSWK_remoteTransReq;

/** \enum tSWK_idExtBit
 *  \brief Enum for the TLE9563 Identifier Extension Bit
 */
typedef enum _tSWK_idExtBit
{
  SWK_idExtBit_std = 0,                                     /** \brief  Standard Identifier Length (11 bit) */
  SWK_idExtBit_ext = 1                                      /** \brief  Extended Identifier Length (29 bit) */
} tSWK_idExtBit;

/** \enum tSWK_dataLengthCode
 *  \brief Enum for the TLE9563 Payload length in number of bytes 
 */
typedef enum _tSWK_dataLengthCode
{
  SWK_dataLengthCode_0 = 0,                                 /** \brief  Frame Data Length = 0 or cleared */
  SWK_dataLengthCode_1 = 1,                                 /** \brief  Frame Data Length = 1 */
  SWK_dataLengthCode_2 = 2,                                 /** \brief  Frame Data Length = 2 */
  SWK_dataLengthCode_3 = 3,                                 /** \brief  Frame Data Length = 3 */
  SWK_dataLengthCode_4 = 4,                                 /** \brief  Frame Data Length = 4 */
  SWK_dataLengthCode_5 = 5,                                 /** \brief  Frame Data Length = 5 */
  SWK_dataLengthCode_6 = 6,                                 /** \brief  Frame Data Length = 6 */
  SWK_dataLengthCode_7 = 7,                                 /** \brief  Frame Data Length = 7 */
  SWK_dataLengthCode_8 = 8                                  /** \brief  to 1111B Frame Data Length = 8 */
} tSWK_dataLengthCode;

/** \enum tCANFD_domFiltTime
 *  \brief Enum for the TLE9563 CAN FD Dominant Filter Time
 */
typedef enum _tCANFD_domFiltTime
{
  CANFD_domFiltTime_50ns = 0,                               /** \brief  50 ns */
  CANFD_domFiltTime_100ns = 1,                              /** \brief  100 ns */
  CANFD_domFiltTime_150ns = 2,                              /** \brief  150 ns */
  CANFD_domFiltTime_200ns = 3,                              /** \brief  200 ns */
  CANFD_domFiltTime_250ns = 4,                              /** \brief  250 ns */
  CANFD_domFiltTime_300ns = 5,                              /** \brief  300 ns */
  CANFD_domFiltTime_350ns = 6,                              /** \brief  350 ns */
  CANFD_domFiltTime_775ns = 7                               /** \brief  775 ns */
} tCANFD_domFiltTime;

/** \enum tSWK_receiver
 *  \brief Enum for the TLE9563 SWK Receiver selection (only accessible if TRIM_EN = '11')
 */
typedef enum _tSWK_receiver
{
  SWK_receiver_lowpower = 0,                                /** \brief  Low-Power Receiver selected during SWK */
  SWK_receiver_std = 1                                      /** \brief  Standard Receiver selected during SWK */
} tSWK_receiver;

/** \enum tSWK_clockDataRecoveryInputFreq
 *  \brief Enum for the TLE9563 Select Time Constant of Filter
 */
typedef enum _tSWK_clockDataRecoveryInputFreq
{
  SWK_clockDataRecoveryInputFreq_8 = 0,                     /** \brief  Time constant 8 */
  SWK_clockDataRecoveryInputFreq_16 = 1,                    /** \brief  Time constant 16 (default) */
  SWK_clockDataRecoveryInputFreq_32 = 2,                    /** \brief  Time constant 32 */
  SWK_clockDataRecoveryInputFreq_adaptive = 3               /** \brief  adapt distance between falling edges 2, 3 bit Time constant 32; distance between falling edges 4, 5, 6, 7, 8 bit Time constant 16; distance between falling edges 9, 10 bit Time constant 8 */
} tSWK_clockDataRecoveryInputFreq;

/** \enum tSWK_filtTimeConst
 *  \brief Enum for the TLE9563 Select Time Constant of Filter
 */
typedef enum _tSWK_filtTimeConst
{
  SWK_filtTimeConst_8 = 0,                                  /** \brief  Time constant 8 */
  SWK_filtTimeConst_16 = 1,                                 /** \brief  Time constant 16 (default) */
  SWK_filtTimeConst_32 = 2,                                 /** \brief  Time constant 32 */
  SWK_filtTimeConst_adaptive = 3                            /** \brief  adapt distance between falling edges 2, 3 bit Time constant 32; distance between falling edges 4, 5, 6, 7, 8 bit Time constant 16; distance between falling edges 9, 10 bit Time constant 8 */
} tSWK_filtTimeConst;

/** \enum tBDRV_tBlank
 *  \brief Enum for the TLE9563 Blank time
 */
typedef enum _tBDRV_tBlank
{
  BDRV_tBlank_587ns = 0,                                     /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_853ns = 1,                                     /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_1119ns = 2,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_1385ns = 3,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_1651ns = 4,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_1917ns = 5,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_2183ns = 6,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_2449ns = 7,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% (default) */
  BDRV_tBlank_2715ns = 8,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_2981ns = 9,                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_3247ns = 10,                                   /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_3513ns = 11,                                   /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_3779ns = 12,                                   /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_4045ns = 13,                                   /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_4311ns = 14,                                   /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
  BDRV_tBlank_4577ns = 15                                    /** \brief  nom. tHBxBLANK = 587 ns + 266 x T[3:0]D, +/- 20% */
} tBDRV_tBlank;

/** \enum tBDRV_tCcp
 *  \brief Enum for the TLE9563 Cross-current protection time
 */
typedef enum _tBDRV_tCcp
{
  BDRV_tCcp_587ns = 0,                                       /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_853ns = 1,                                       /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_1119ns = 2,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_1385ns = 3,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_1651ns = 4,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_1917ns = 5,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_2183ns = 6,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_2449ns = 7,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% (default) */
  BDRV_tCcp_2715ns = 8,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_2981ns = 9,                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_3247ns = 10,                                     /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_3513ns = 11,                                     /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_3779ns = 12,                                     /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_4045ns = 13,                                     /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_4311ns = 14,                                     /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
  BDRV_tCcp_4577ns = 15                                      /** \brief  nom. tHBxCCP = 587 ns + 266 x TCCP[3:0]D, +/- 20% */
} tBDRV_tCcp;

/** \enum tBDRV_preChargeDischargeTime
 *  \brief Enum for the TLE9563 If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 */
typedef enum _tBDRV_preChargeDischargeTime
{
  BDRV_preChargeDischargeTime_107ns = 0,                     /** \brief  tPCHG000 min =  80 ns, typ = 107 ns, max =  140 ns */
  BDRV_preChargeDischargeTime_160ns = 1,                     /** \brief  tPCHG001 min = 130 ns, typ = 160 ns, max =  190 ns */
  BDRV_preChargeDischargeTime_214ns = 2,                     /** \brief  tPCHG010 min = 170 ns, typ = 214 ns, max =  260 ns */
  BDRV_preChargeDischargeTime_267ns = 3,                     /** \brief  tPCHG011 min = 210 ns, typ = 267 ns, max =  330 ns */
  BDRV_preChargeDischargeTime_320ns = 4,                     /** \brief  tPCHG100 min = 250 ns, typ = 320 ns, max =  390 ns */
  BDRV_preChargeDischargeTime_533ns = 5,                     /** \brief  tPCHG101 min = 420 ns, typ = 533 ns, max =  630 ns */
  BDRV_preChargeDischargeTime_747ns = 6,                     /** \brief  tPCHG110 min = 600 ns, typ = 747 ns, max =  900 ns */
  BDRV_preChargeDischargeTime_1067ns = 7                     /** \brief  tPCHG111 min = 840 ns, typ = 1067 ns, max = 1260 ns */
} tBDRV_preChargeDischargeTime;

/** \enum tBDRV_staticChargeDischargeCur
 *  \brief Enum for the TLE9563 Static charge and discharge currents of HB3
 */
typedef enum _tBDRV_staticChargeDischargeCur
{
  BDRV_staticChargeDischargeCur_0mA5 = 0,                    /** \brief  0000B  0.5   mA (ICHG0) , 0.5   mA (IDCHG0) , +/- 60% */
  BDRV_staticChargeDischargeCur_1mA8 = 1,                    /** \brief  0001B  1.8   mA (ICHG4) , 1.8   mA (IDCHG4) , +/- 60% */
  BDRV_staticChargeDischargeCur_4mA7 = 2,                    /** \brief  0010B  4.7   mA (ICHG8) , 4.7   mA (IDCHG8) , +/- 60% */
  BDRV_staticChargeDischargeCur_9mA4 = 3,                    /** \brief  0011B  9.4   mA (ICHG12), 9.4   mA (IDCHG12), +/- 60% */
  BDRV_staticChargeDischargeCur_15mA3 = 4,                   /** \brief  0100B  15.3  mA (ICHG16), 15.1  mA (IDCHG16), +/- 40% */
  BDRV_staticChargeDischargeCur_23mA = 5,                    /** \brief  0101B  23    mA (ICHG20), 22.5  mA (IDCHG20), +/- 40% */
  BDRV_staticChargeDischargeCur_31mA6 = 6,                   /** \brief  0110B  31.6  mA (ICHG24), 30.9  mA (IDCHG24), +/- 40% */
  BDRV_staticChargeDischargeCur_41mA6 = 7,                   /** \brief  0111B  41.6  mA (ICHG28), 40.8  mA (IDCHG28), +/- 40% */
  BDRV_staticChargeDischargeCur_52mA5 = 8,                   /** \brief  1000B  52.5  mA (ICHG32), 51.5  mA (IDCHG32), +/- 30% */
  BDRV_staticChargeDischargeCur_63mA6 = 9,                   /** \brief  1001B  63.6  mA (ICHG36), 62.4  mA (IDCHG36), +/- 30% */
  BDRV_staticChargeDischargeCur_75mA2 = 10,                  /** \brief  1010B  75.2  mA (ICHG40), 73.7  mA (IDCHG40), +/- 30% */
  BDRV_staticChargeDischargeCur_87mA1 = 11,                  /** \brief  1011B  87.1  mA (ICHG44), 85.5  mA (IDCHG44), +/- 30% */
  BDRV_staticChargeDischargeCur_99mA5 = 12,                  /** \brief  1100B  99.5  mA (ICHG48), 97.7  mA (IDCHG48), +/- 30% */
  BDRV_staticChargeDischargeCur_112mA2 = 13,                 /** \brief  1101B  112.2 mA (ICHG52), 110.8 mA (IDCHG52), +/- 30% */
  BDRV_staticChargeDischargeCur_125mA3 = 14,                 /** \brief  1110B  125.3 mA (ICHG56), 124.5 mA (IDCHG56), +/- 30% */
  BDRV_staticChargeDischargeCur_139mA  = 15                  /** \brief  1111B  139   mA (ICHG60), 138.7 mA (IDCHG60), +/- 30% */
} tBDRV_staticChargeDischargeCur;

