jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/** \enum tBDRV_dischargeCur
 *  \brief Enum for the TLE9563 If ICHG_BNK =0xxB Discharge current of HBx active MOSFET
 */
typedef enum _tBDRV_dischargeCur
{
  BDRV_dischargeCur_0mA5 = 0,                                /** \brief  000000B  IDCHG0  0.5   mA, +/- 60% */
  BDRV_dischargeCur_0mA7 = 1,                                /** \brief  000001B  IDCHG1  0.7   mA, +/- 60% */
  BDRV_dischargeCur_1mA = 2,                                 /** \brief  000010B  IDCHG2  1.0   mA, +/- 60% */
  BDRV_dischargeCur_1mA4 = 3,                                /** \brief  000011B  IDCHG3  1.4   mA, +/- 60% */
  BDRV_dischargeCur_1mA8 = 4,                                /** \brief  000100B  IDCHG4  1.8   mA, +/- 60% */
  BDRV_dischargeCur_2mA4 = 5,                                /** \brief  000101B  IDCHG5  2.4   mA, +/- 60% */
  BDRV_dischargeCur_3mA = 6,                                 /** \brief  000110B  IDCHG6  3.0   mA, +/- 60% */
  BDRV_dischargeCur_3mA8 = 7,                                /** \brief  000111B  IDCHG7  3.8   mA, +/- 60% */
  BDRV_dischargeCur_4mA7 = 8,                                /** \brief  001000B  IDCHG8  4.7   mA, +/- 60% */
  BDRV_dischargeCur_5mA8 = 9,                                /** \brief  001001B  IDCHG9  5.8   mA, +/- 60% */
  BDRV_dischargeCur_6mA9 = 10,                               /** \brief  001010B  IDCHG10 6.9   mA, +/- 60% */
  BDRV_dischargeCur_8mA1 = 11,                               /** \brief  001011B  IDCHG11 8.1   mA, +/- 60% */
  BDRV_dischargeCur_9mA4 = 12,                               /** \brief  001100B  IDCHG12 9.4   mA, +/- 60% */
  BDRV_dischargeCur_10mA7 = 13,                              /** \brief  001101B  IDCHG13 10.7  mA, +/- 60% */
  BDRV_dischargeCur_12mA1 = 14,                              /** \brief  001110B  IDCHG14 12.1  mA, +/- 40% */
  BDRV_dischargeCur_13mA5 = 15,                              /** \brief  001111B  IDCHG15 13.5  mA, +/- 40% */
  BDRV_dischargeCur_15mA1 = 16,                              /** \brief  010000B  IDCHG16 15.1  mA, +/- 40% */
  BDRV_dischargeCur_16mA8 = 17,                              /** \brief  010001B  IDCHG17 16.8  mA, +/- 40% */
  BDRV_dischargeCur_18mA6 = 18,                              /** \brief  010010B  IDCHG18 18.6  mA, +/- 40% */
  BDRV_dischargeCur_20mA5 = 19,                              /** \brief  010011B  IDCHG19 20.5  mA, +/- 40% */
  BDRV_dischargeCur_22mA5 = 20,                              /** \brief  010100B  IDCHG20 22.5  mA, +/- 40% */
  BDRV_dischargeCur_24mA5 = 21,                              /** \brief  010101B  IDCHG21 24.5  mA, +/- 40% */
  BDRV_dischargeCur_26mA5 = 22,                              /** \brief  010110B  IDCHG22 26.5  mA, +/- 40% */
  BDRV_dischargeCur_28mA7 = 23,                              /** \brief  010111B  IDCHG23 28.7  mA, +/- 40% */
  BDRV_dischargeCur_30mA9 = 24,                              /** \brief  011000B  IDCHG24 30.9  mA, +/- 40% */
  BDRV_dischargeCur_33mA2 = 25,                              /** \brief  011001B  IDCHG25 33.2  mA, +/- 40% */
  BDRV_dischargeCur_35mA7 = 26,                              /** \brief  011010B  IDCHG26 35.7  mA, +/- 40% */
  BDRV_dischargeCur_38mA2 = 27,                              /** \brief  011011B  IDCHG27 38.2  mA, +/- 40% */
  BDRV_dischargeCur_40mA8 = 28,                              /** \brief  011100B  IDCHG28 40.8  mA, +/- 40% */
  BDRV_dischargeCur_43mA4 = 29,                              /** \brief  011101B  IDCHG29 43.4  mA, +/- 30% */
  BDRV_dischargeCur_46mA1 = 30,                              /** \brief  011110B  IDCHG30 46.1  mA, +/- 30% */
  BDRV_dischargeCur_48mA8 = 31,                              /** \brief  011111B  IDCHG31 48.8  mA, +/- 30% */
  BDRV_dischargeCur_51mA5 = 32,                              /** \brief  100000B  IDCHG32 51.5  mA, +/- 30% */
  BDRV_dischargeCur_54mA2 = 33,                              /** \brief  100001B  IDCHG33 54.2  mA, +/- 30% */
  BDRV_dischargeCur_56mA9 = 34,                              /** \brief  100010B  IDCHG34 56.9  mA, +/- 30% */
  BDRV_dischargeCur_59mA6 = 35,                              /** \brief  100011B  IDCHG35 59.6  mA, +/- 30% */
  BDRV_dischargeCur_62mA4 = 36,                              /** \brief  100100B  IDCHG36 62.4  mA, +/- 30% */
  BDRV_dischargeCur_65mA2 = 37,                              /** \brief  100101B  IDCHG37 65.2  mA, +/- 30% */
  BDRV_dischargeCur_68mA = 38,                               /** \brief  100110B  IDCHG38 68    mA, +/- 30% */
  BDRV_dischargeCur_70mA8 = 39,                              /** \brief  100111B  IDCHG39 70.8  mA, +/- 30% */
  BDRV_dischargeCur_73mA7 = 40,                              /** \brief  101000B  IDCHG40 73.7  mA, +/- 30% */
  BDRV_dischargeCur_76mA6 = 41,                              /** \brief  101001B  IDCHG41 76.6  mA, +/- 30% */
  BDRV_dischargeCur_79mA5 = 42,                              /** \brief  101010B  IDCHG42 79.5  mA, +/- 30% */
  BDRV_dischargeCur_82mA5 = 43,                              /** \brief  101011B  IDCHG43 82.5  mA, +/- 30% */
  BDRV_dischargeCur_85mA5 = 44,                              /** \brief  101100B  IDCHG44 85.5  mA, +/- 30% */
  BDRV_dischargeCur_88mA5 = 45,                              /** \brief  101101B  IDCHG45 88.5  mA, +/- 30% */
  BDRV_dischargeCur_91mA5 = 46,                              /** \brief  101110B  IDCHG46 91.5  mA, +/- 30% */
  BDRV_dischargeCur_94mA6 = 47,                              /** \brief  101111B  IDCHG47 94.6  mA, +/- 30% */
  BDRV_dischargeCur_97mA7 = 48,                              /** \brief  110000B  IDCHG48 97.7  mA, +/- 30% */
  BDRV_dischargeCur_100mA9 = 49,                             /** \brief  110001B  IDCHG49 100.9 mA, +/- 30% */
  BDRV_dischargeCur_104mA2 = 50,                             /** \brief  110010B  IDCHG50 104.2 mA, +/- 30% */
  BDRV_dischargeCur_107mA5 = 51,                             /** \brief  110011B  IDCHG51 107.5 mA, +/- 30% */
  BDRV_dischargeCur_110mA8 = 52,                             /** \brief  110100B  IDCHG52 110.8 mA, +/- 30% */
  BDRV_dischargeCur_114mA2 = 53,                             /** \brief  110101B  IDCHG53 114.2 mA, +/- 30% */
  BDRV_dischargeCur_117mA6 = 54,                             /** \brief  110110B  IDCHG54 117.6 mA, +/- 30% */
  BDRV_dischargeCur_121mA = 55,                              /** \brief  110111B  IDCHG55 121   mA, +/- 30% */
  BDRV_dischargeCur_124mA5 = 56,                             /** \brief  111000B  IDCHG56 124.5 mA, +/- 30% */
  BDRV_dischargeCur_128mA = 57,                              /** \brief  111001B  IDCHG57 128   mA, +/- 30% */
  BDRV_dischargeCur_131mA5 = 58,                             /** \brief  111010B  IDCHG58 131.5 mA, +/- 30% */
  BDRV_dischargeCur_135mA1 = 59,                             /** \brief  111011B  IDCHG59 135.1 mA, +/- 30% */
  BDRV_dischargeCur_138mA7 = 60,                             /** \brief  111100B  IDCHG60 138.7 mA, +/- 30% */
  BDRV_dischargeCur_142mA3 = 61,                             /** \brief  111101B  IDCHG61 142.3 mA, +/- 30% */
  BDRV_dischargeCur_145mA8 = 62,                             /** \brief  111110B  IDCHG62 145.8 mA, +/- 30% */
  BDRV_dischargeCur_150mA = 63                               /** \brief  111111B  IDCHG63 150   mA, +/- 30% */
} tBDRV_dischargeCur;

