jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/** \enum tBDRV_chargeCur
 *  \brief Enum for the TLE9563 If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 */
typedef enum _tBDRV_chargeCur
{
  BDRV_chargeCur_0mA5 = 0,                                   /** \brief  000000B  ICHG0  0.5   mA, +/- 60% */
  BDRV_chargeCur_0mA7 = 1,                                   /** \brief  000001B  ICHG1  0.7   mA, +/- 60% */
  BDRV_chargeCur_1mA = 2,                                    /** \brief  000010B  ICHG2  1.0   mA, +/- 60% */
  BDRV_chargeCur_1mA4 = 3,                                   /** \brief  000011B  ICHG3  1.4   mA, +/- 60% */
  BDRV_chargeCur_1mA8 = 4,                                   /** \brief  000100B  ICHG4  1.8   mA, +/- 60% */
  BDRV_chargeCur_2mA4 = 5,                                   /** \brief  000101B  ICHG5  2.4   mA, +/- 60% */
  BDRV_chargeCur_3mA = 6,                                    /** \brief  000110B  ICHG6  3.0   mA, +/- 60% */
  BDRV_chargeCur_3mA8 = 7,                                   /** \brief  000111B  ICHG7  3.8   mA, +/- 60% */
  BDRV_chargeCur_4mA7 = 8,                                   /** \brief  001000B  ICHG8  4.7   mA, +/- 55% */
  BDRV_chargeCur_5mA8 = 9,                                   /** \brief  001001B  ICHG9  5.8   mA, +/- 55% */
  BDRV_chargeCur_6mA9 = 10,                                  /** \brief  001010B  ICHG10 6.9   mA, +/- 55% */
  BDRV_chargeCur_8mA1 = 11,                                  /** \brief  001011B  ICHG11 8.1   mA, +/- 55% */
  BDRV_chargeCur_9mA4 = 12,                                  /** \brief  001100B  ICHG12 9.4   mA, +/- 55% */
  BDRV_chargeCur_10mA8 = 13,                                 /** \brief  001101B  ICHG13 10.8  mA, +/- 55% */
  BDRV_chargeCur_12mA2 = 14,                                 /** \brief  001110B  ICHG14 12.2  mA, +/- 40% */
  BDRV_chargeCur_13mA7 = 15,                                 /** \brief  001111B  ICHG15 13.7  mA, +/- 40% */
  BDRV_chargeCur_15mA3 = 16,                                 /** \brief  010000B  ICHG16 15.3  mA, +/- 40% */
  BDRV_chargeCur_17mA1 = 17,                                 /** \brief  010001B  ICHG17 17.1  mA, +/- 40% */
  BDRV_chargeCur_19mA = 18,                                  /** \brief  010010B  ICHG18 19    mA, +/- 40% */
  BDRV_chargeCur_21mA = 19,                                  /** \brief  010011B  ICHG19 21    mA, +/- 40% */
  BDRV_chargeCur_23mA = 20,                                  /** \brief  010100B  ICHG20 23    mA, +/- 40% */
  BDRV_chargeCur_25mA = 21,                                  /** \brief  010101B  ICHG21 25    mA, +/- 40% */
  BDRV_chargeCur_27mA1 = 22,                                 /** \brief  010110B  ICHG22 27.1  mA, +/- 40% */
  BDRV_chargeCur_29mA3 = 23,                                 /** \brief  010111B  ICHG23 29.3  mA, +/- 40% */
  BDRV_chargeCur_31mA6 = 24,                                 /** \brief  011000B  ICHG24 31.6  mA, +/- 40% */
  BDRV_chargeCur_34mA = 25,                                  /** \brief  011001B  ICHG25 34    mA, +/- 40% */
  BDRV_chargeCur_36mA5 = 26,                                 /** \brief  011010B  ICHG26 36.5  mA, +/- 40% */
  BDRV_chargeCur_39mA = 27,                                  /** \brief  011011B  ICHG27 39    mA, +/- 40% */
  BDRV_chargeCur_41mA6 = 28,                                 /** \brief  011100B  ICHG28 41.6  mA, +/- 40% */
  BDRV_chargeCur_44mA2 = 29,                                 /** \brief  011101B  ICHG29 44.2  mA, +/- 30% */
  BDRV_chargeCur_46mA9 = 30,                                 /** \brief  011110B  ICHG30 46.9  mA, +/- 30% */
  BDRV_chargeCur_49mA7 = 31,                                 /** \brief  011111B  ICHG31 49.7  mA, +/- 30% */
  BDRV_chargeCur_52mA5 = 32,                                 /** \brief  100000B  ICHG32 52.5  mA, +/- 30% */
  BDRV_chargeCur_55mA3 = 33,                                 /** \brief  100001B  ICHG33 55.3  mA, +/- 30% */
  BDRV_chargeCur_58mA1 = 34,                                 /** \brief  100010B  ICHG34 58.1  mA, +/- 30% */
  BDRV_chargeCur_60mA8 = 35,                                 /** \brief  100011B  ICHG35 60.8  mA, +/- 30% */
  BDRV_chargeCur_63mA6 = 36,                                 /** \brief  100100B  ICHG36 63.6  mA, +/- 30% */
  BDRV_chargeCur_66mA5 = 37,                                 /** \brief  100101B  ICHG37 66.5  mA, +/- 30% */
  BDRV_chargeCur_69mA4 = 38,                                 /** \brief  100110B  ICHG38 69.4  mA, +/- 30% */
  BDRV_chargeCur_72mA3 = 39,                                 /** \brief  100111B  ICHG39 72.3  mA, +/- 30% */
  BDRV_chargeCur_75mA2 = 40,                                 /** \brief  101000B  ICHG40 75.2  mA, +/- 30% */
  BDRV_chargeCur_78mA1 = 41,                                 /** \brief  101001B  ICHG41 78.1  mA, +/- 30% */
  BDRV_chargeCur_81mA1 = 42,                                 /** \brief  101010B  ICHG42 81.1  mA, +/- 30% */
  BDRV_chargeCur_84mA1 = 43,                                 /** \brief  101011B  ICHG43 84.1  mA, +/- 30% */
  BDRV_chargeCur_87mA1 = 44,                                 /** \brief  101100B  ICHG44 87.1  mA, +/- 30% */
  BDRV_chargeCur_90mA2 = 45,                                 /** \brief  101101B  ICHG45 90.2  mA, +/- 30% */
  BDRV_chargeCur_93mA3 = 46,                                 /** \brief  101110B  ICHG46 93.3  mA, +/- 30% */
  BDRV_chargeCur_96mA4 = 47,                                 /** \brief  101111B  ICHG47 96.4  mA, +/- 30% */
  BDRV_chargeCur_99mA5 = 48,                                 /** \brief  110000B  ICHG48 99.5  mA, +/- 30% */
  BDRV_chargeCur_102mA7 = 49,                                /** \brief  110001B  ICHG49 102.7 mA, +/- 30% */
  BDRV_chargeCur_105mA8 = 50,                                /** \brief  110010B  ICHG50 105.8 mA, +/- 30% */
  BDRV_chargeCur_109mA = 51,                                 /** \brief  110011B  ICHG51 109   mA, +/- 30% */
  BDRV_chargeCur_112mA2 = 52,                                /** \brief  110100B  ICHG52 112.2 mA, +/- 30% */
  BDRV_chargeCur_115mA4 = 53,                                /** \brief  110101B  ICHG53 115.4 mA, +/- 30% */
  BDRV_chargeCur_118mA7 = 54,                                /** \brief  110110B  ICHG54 118.7 mA, +/- 30% */
  BDRV_chargeCur_122mA = 55,                                 /** \brief  110111B  ICHG55 122   mA, +/- 30% */
  BDRV_chargeCur_125mA3 = 56,                                /** \brief  111000B  ICHG56 125.3 mA, +/- 30% */
  BDRV_chargeCur_128mA7 = 57,                                /** \brief  111001B  ICHG57 128.7 mA, +/- 30% */
  BDRV_chargeCur_132mA1 = 58,                                /** \brief  111010B  ICHG58 132.1 mA, +/- 30% */
  BDRV_chargeCur_135mA5 = 59,                                /** \brief  111011B  ICHG59 135.5 mA, +/- 30% */
  BDRV_chargeCur_139mA = 60,                                 /** \brief  111100B  ICHG60 139   mA, +/- 30% */
  BDRV_chargeCur_142mA5 = 61,                                /** \brief  111101B  ICHG61 142.5 mA, +/- 30% */
  BDRV_chargeCur_146mA = 62,                                 /** \brief  111110B  ICHG62 146   mA, +/- 30% */
  BDRV_chargeCur_150mA = 63                                  /** \brief  111111B  ICHG63 150   mA, +/- 30% */
} tBDRV_chargeCur;

/** \enum tBDRV_tdon
 *  \brief Enum for the TLE9563 Turn-on delay time of active MOSFET of HBx
 */
typedef enum _tBDRV_tdon
{
  BDRV_tdon_0ns = 0,                                         /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_53ns = 1,                                        /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_107ns = 2,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_160ns = 3,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_213ns = 4,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_267ns = 5,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_320ns = 6,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_373ns = 7,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_426ns = 8,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_480ns = 9,                                       /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_533ns = 10,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_586ns = 11,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_640ns = 12,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D (default) */
  BDRV_tdon_693ns = 13,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_746ns = 14,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_800ns = 15,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_853ns = 16,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_906ns = 17,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_959ns = 18,                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1013ns = 19,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1066ns = 20,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1119ns = 21,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1173ns = 22,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1226ns = 23,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1279ns = 24,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1333ns = 25,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1386ns = 26,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1439ns = 27,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1492ns = 28,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1546ns = 29,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1599ns = 30,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1652ns = 31,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1706ns = 32,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1759ns = 33,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1812ns = 34,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1866ns = 35,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1919ns = 36,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_1972ns = 37,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2025ns = 38,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2079ns = 39,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2132ns = 40,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2185ns = 41,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2239ns = 42,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2292ns = 43,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2345ns = 44,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2399ns = 45,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2452ns = 46,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2505ns = 47,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2558ns = 48,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2612ns = 49,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2665ns = 50,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2718ns = 51,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2772ns = 52,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2825ns = 53,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2878ns = 54,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2932ns = 55,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_2985ns = 56,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3038ns = 57,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3091ns = 58,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3145ns = 59,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3198ns = 60,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3251ns = 61,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3305ns = 62,                                     /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
  BDRV_tdon_3358ns = 63                                      /** \brief  Nominal tDON = 53.3 ns x TDON[5:0]D */
} tBDRV_tdon;

/** \enum tBDRV_tdoff
 *  \brief Enum for the TLE9563 Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 */
typedef enum _tBDRV_tdoff
{
  BDRV_tdoff_0ns = 0,                                        /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_53ns = 1,                                       /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_107ns = 2,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_160ns = 3,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_213ns = 4,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_267ns = 5,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_320ns = 6,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_373ns = 7,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_426ns = 8,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_480ns = 9,                                      /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_533ns = 10,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_586ns = 11,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_640ns = 12,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D (default) */
  BDRV_tdoff_693ns = 13,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_746ns = 14,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_800ns = 15,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_853ns = 16,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_906ns = 17,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_959ns = 18,                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1013ns = 19,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1066ns = 20,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1119ns = 21,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1173ns = 22,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1226ns = 23,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1279ns = 24,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1333ns = 25,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1386ns = 26,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1439ns = 27,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1492ns = 28,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1546ns = 29,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1599ns = 30,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1652ns = 31,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1706ns = 32,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1759ns = 33,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1812ns = 34,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1866ns = 35,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1919ns = 36,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_1972ns = 37,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2025ns = 38,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2079ns = 39,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2132ns = 40,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2185ns = 41,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2239ns = 42,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2292ns = 43,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2345ns = 44,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2399ns = 45,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2452ns = 46,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2505ns = 47,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2558ns = 48,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2612ns = 49,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2665ns = 50,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2718ns = 51,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2772ns = 52,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2825ns = 53,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2878ns = 54,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2932ns = 55,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_2985ns = 56,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3038ns = 57,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3091ns = 58,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3145ns = 59,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3198ns = 60,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3251ns = 61,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3305ns = 62,                                    /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
  BDRV_tdoff_3358ns = 63                                     /** \brief  Nominal tDOFF = 53.3 ns x TDOFF[5:0]D */
} tBDRV_tdoff;

