jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
/** \enum tBDRV_setAllHbx
 *  \brief Enum for the setting of HBMODE control register. To be used in \ref TLE9563_setAllHbx
 */
typedef enum _tBDRV_setAllHbx
{
  BDRV_setAllHbx_passiveOff_afwEn_pwmInact = 0x0222,         /** \brief  Half-bridge mode = PASSIVE_OFF (default), Active freewheeling = ENABLED (default), PWM mode = INACTIVE (default) */
  BDRV_setAllHbx_activeOff_afwEn_pwmInact = 0x0EEE,          /** \brief  Half-bridge mode = ACTIVE_OFF, Active freewheeling = ENABLED (default), PWM mode = INACTIVE (default) */
  BDRV_setAllHbx_lsOn_afwEn_PwmInact = 0x0666,               /** \brief  Half-bridge mode = LSx_ON, Active freewheeling = ENABLED (default), PWM mode = INACTIVE (default) */
  BDRV_setAllHbx_hsOn_afwEn_PwmInact = 0x0AAA,               /** \brief  Half-bridge mode = HSx_ON, Active freewheeling = ENABLED (default), PWM mode = INACTIVE (default) */
  BDRV_setAllHbx_lsOn_afwEn_pwmAct= 0x0777,                  /** \brief  Half-bridge mode = LSx_ON, Active freewheeling = ENABLED (default), PWM mode = ACTIVE */
  BDRV_setAllHbx_hsOn_afwEn_pwmAct= 0x0BBB,                  /** \brief  Half-bridge mode = HSx_ON, Active freewheeling = ENABLED (default), PWM mode = ACTIVE */
  BDRV_setAllHbx_lsOn_afwDis_pwmAct = 0x0555,                /** \brief  Half-bridge mode = LSx_ON, Active freewheeling = DISABLED, PWM mode = ACTIVE */
  BDRV_setAllHbx_hsOn_afwDis_pwmAct = 0x0999,                /** \brief  Half-bridge mode = HSx_ON, Active freewheeling = DISABLED, PWM mode = ACTIVE */ 
} tBDRV_setAllHbx;

/** \brief function pointer fpDEVICE_setDeviceReg
*/
typedef void (*fpDEVICE_setDeviceReg)(uint16_t);

/** \brief function pointer fpDEVICE_getDeviceReg
*/
typedef void (*fpDEVICE_getDeviceReg)(void);

/** \brief function pointer fpDEVICE_updateRamReg
*/
typedef void (*fpDEVICE_updateRamReg)(uint16_t);

/** \union unDEVICE_spiBuffer
 *  \brief Union for content of last received SPI message
 */
typedef  union _unDEVICE_spiBuffer
{
  uint8_t     au8Bytes[4];
  uint32_t    u32Word;
} unDEVICE_spiBuffer;

/** \union unDEVICE_crcResult
 *  \brief Union for expected result for crc of last received SPI message
 */
typedef  union _unDEVICE_crcResult
{
  uint8_t     au8Bytes[4];
  uint32_t    u32Word;
} unDEVICE_crcResult;

/** \struct sDeviceDriver
 *  \brief Struct for Device Driver cyclic task
 */
typedef struct _sDEVICE_deviceDriver
{
  uint8_t u8_deviceDriverStatus;                              /** \brief  device driver status */
  uint8_t u8_deviceDriverErrorLog;                            /** \brief  device driver error log */
  unDEVICE_spiBuffer un_SpiRx;                                /** \brief  content of last received SPI message */
  unDEVICE_crcResult un_CrcResult;                            /** \brief  expected result for crc of last received SPI message */
  fpDEVICE_setDeviceReg fp_setReg;                            /** \brief  function pointer to next set register function */
  fpDEVICE_getDeviceReg fp_getReg;                            /** \brief  function pointer to next get register function */
  fpDEVICE_updateRamReg fp_updateRamReg;                      /** \brief  function pointer to next update RAM register function */
  uint16_t u16_setBitValue;                                   /** \brief  value to be used in next set register function */
} sDEVICE_deviceDriver;

/*******************************************************************************
**                        Global Variable Declarations                        **
*******************************************************************************/
extern sDEVICE_deviceDriver s_deviceDriver;

/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/
uint8_t TLE9563_deviceDriverCyclicTask(void);
uint8_t TLE9563_Init(void);
uint8_t TLE9563_serveWatchdog(void);
uint8_t TLE9563_getSif(void);
uint8_t TLE9563_getSifBitSupplyStatus(void);
uint8_t TLE9563_getSifBitTempStatus(void);
uint8_t TLE9563_getSifBitBusStatus(void);
uint8_t TLE9563_getSifBitWakeUp(void);
uint8_t TLE9563_getSifBitHsStatus(void);
uint8_t TLE9563_getSifBitDeviceStatus(void);
uint8_t TLE9563_getSifBitBdrvStatus(void);
uint8_t TLE9563_getSifBitSpiCrcFail(void);
uint8_t TLE9563_recoverCrc(void);
void TLE9563_resetLastSetBitfieldRequest(void);
uint8_t TLE9563_setAllHbx(tBDRV_setAllHbx e_value);

uint16_t TLE9563_getModeSupplyCtrlReg(void);
uint8_t TLE9563_setModeSupplyCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setDeviceMode(tDEVICE_mode e_value);
uint16_t TLE9563_getDeviceMode(void);
uint8_t TLE9563_setVcc1OverVoltReact(tVCC1_overVoltReact e_value);
uint16_t TLE9563_getVcc1OverVoltReact(void);
uint8_t TLE9563_setVcc1UnderVoltResetHys(tVCC1_underVoltResetHys e_value);
uint16_t TLE9563_getVcc1UnderVoltResetHys(void);
uint8_t TLE9563_setVcc1ActPeakThresh(tVCC1_actPeakThresh e_value);
uint16_t TLE9563_getVcc1ActPeakThresh(void);
uint8_t TLE9563_setVcc1ResetThresh(tVCC1_resetThresh e_value);
uint16_t TLE9563_getVcc1ResetThresh(void);
uint16_t TLE9563_getHwCtrlReg(void);
uint8_t TLE9563_setHwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setTempShutDown2MinWaitTime(tTSD2_minWaitTime e_value);
uint16_t TLE9563_getTempShutDown2MinWaitTime(void);
uint8_t TLE9563_setVsOverVoltThresh(tVS_overVoltThresh e_value);
uint16_t TLE9563_getVsOverVoltThresh(void);
uint8_t TLE9563_enBdrvSampleAndHoldCiruit(void);
uint8_t TLE9563_disBdrvSampleAndHoldCiruit(void);
uint8_t TLE9563_getBdrvSampleAndHoldCiruit(void);
uint8_t TLE9563_setResetDelayTime(tRST_delayTime e_value);
uint16_t TLE9563_getResetDelayTime(void);
uint8_t TLE9563_setSoftResetConfig(tSOFTRST_config e_value);
uint16_t TLE9563_getSoftResetConfig(void);
uint8_t TLE9563_enWdDeactDuringStopModeBit1(void);
uint8_t TLE9563_disWdDeactDuringStopModeBit1(void);
uint8_t TLE9563_getWdDeactDuringStopModeBit1(void);
uint16_t TLE9563_getWdCtrlReg(void);
uint8_t TLE9563_setWdCtrlReg(uint16_t u16_value);
uint16_t TLE9563_getWdChecksumBit(void);
uint8_t TLE9563_enWdDeactDuringStopModeBit0(void);
uint8_t TLE9563_disWdDeactDuringStopModeBit0(void);
uint8_t TLE9563_getWdDeactDuringStopModeBit0(void);
uint8_t TLE9563_setWdConfig(tWD_config e_value);
uint16_t TLE9563_getWdConfig(void);
uint8_t TLE9563_enWdAfterBusWkInStopMode(void);
uint8_t TLE9563_disWdAfterBusWkInStopMode(void);
uint8_t TLE9563_getWdAfterBusWkInStopMode(void);
uint8_t TLE9563_setWdTimerPeriod(tWD_timerPeriod e_value);
uint16_t TLE9563_getWdTimerPeriod(void);
uint16_t TLE9563_getBusCtrlReg(void);
uint8_t TLE9563_setBusCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setCanMode(tCAN_mode e_value);
uint16_t TLE9563_getCanMode(void);
uint16_t TLE9563_getWk4CtrlReg(void);
uint8_t TLE9563_setWk4CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setWk4FiltTime(tWK_filtTime e_value);
uint16_t TLE9563_getWk4FiltTime(void);
uint8_t TLE9563_setWk4PullUpPullDown(tWK_pullUpPullDown e_value);
uint16_t TLE9563_getWk4PullUpPullDown(void);
uint8_t TLE9563_enWk4(void);
uint8_t TLE9563_disWk4(void);
uint8_t TLE9563_getWk4(void);
uint16_t TLE9563_getWk5CtrlReg(void);
uint8_t TLE9563_setWk5CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setWk5FiltTime(tWK_filtTime e_value);
uint16_t TLE9563_getWk5FiltTime(void);
uint8_t TLE9563_setWk5PullUpPullDown(tWK_pullUpPullDown e_value);
uint16_t TLE9563_getWk5PullUpPullDown(void);
uint8_t TLE9563_enWk5(void);
uint8_t TLE9563_disWk5(void);
uint8_t TLE9563_getWk5(void);
uint16_t TLE9563_getTimerCtrlReg(void);
uint8_t TLE9563_setTimerCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setTimer2OnTime(tTIMER_onTime e_value);
uint16_t TLE9563_getTimer2OnTime(void);
uint8_t TLE9563_setTimer2Period(tTIMER_period e_value);
uint16_t TLE9563_getTimer2Period(void);
uint8_t TLE9563_setTimerCyclicWk(tTIMER_cyclicWk e_value);
uint16_t TLE9563_getTimerCyclicWk(void);
uint8_t TLE9563_setTimer1OnTime(tTIMER_onTime e_value);
uint16_t TLE9563_getTimer1OnTime(void);
uint8_t TLE9563_setTimer1Period(tTIMER_period e_value);
uint16_t TLE9563_getTimer1Period(void);
uint16_t TLE9563_getHsSwitchShutdownCtrlReg(void);
uint8_t TLE9563_setHsSwitchShutdownCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setHs3VsOverVoltRecovery(tHS_vsOverVoltRecovery e_value);
uint16_t TLE9563_getHs3VsOverVoltRecovery(void);
uint8_t TLE9563_setHs2VsOverVoltRecovery(tHS_vsOverVoltRecovery e_value);
uint16_t TLE9563_getHs2VsOverVoltRecovery(void);
uint8_t TLE9563_setHs1VsOverVoltRecovery(tHS_vsOverVoltRecovery e_value);
uint16_t TLE9563_getHs1VsOverVoltRecovery(void);
uint8_t TLE9563_enHsxOverTempShutDownAll(void);
uint8_t TLE9563_disHsxOverTempShutDownAll(void);
uint8_t TLE9563_getHsxOverTempShutDownAll(void);
uint8_t TLE9563_enHs3VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_disHs3VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_getHs3VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_enHs2VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_disHs2VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_getHs2VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_enHs1VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_disHs1VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_getHs1VsOverVoltShutDownNormalMode(void);
uint8_t TLE9563_enHsxVsOverVoltShutDownStopModeSleepMode(void);
uint8_t TLE9563_disHsxVsOverVoltShutDownStopModeSleepMode(void);
uint8_t TLE9563_getHsxVsOverVoltShutDownStopModeSleepMode(void);
uint8_t TLE9563_enHsxVsUnderVoltShutDown(void);
uint8_t TLE9563_disHsxVsUnderVoltShutDown(void);
uint8_t TLE9563_getHsxVsUnderVoltShutDown(void);
uint8_t TLE9563_setHsxVsUnderVoltRecovery(tHS_vsUnderVoltRecovery e_value);
uint16_t TLE9563_getHsxVsUnderVoltRecovery(void);
uint16_t TLE9563_getHsCtrlReg(void);
uint8_t TLE9563_setHsCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setHs3Config(tHS_config e_value);
uint16_t TLE9563_getHs3Config(void);
uint8_t TLE9563_setHs2Config(tHS_config e_value);
uint16_t TLE9563_getHs2Config(void);
uint8_t TLE9563_setHs1Config(tHS_config e_value);
uint16_t TLE9563_getHs1Config(void);
uint16_t TLE9563_getIntrMaskCtrlReg(void);
uint8_t TLE9563_setIntrMaskCtrlReg(uint16_t u16_value);
uint8_t TLE9563_enIntnPeriodical(void);
uint8_t TLE9563_disIntnPeriodical(void);
uint8_t TLE9563_getIntnPeriodical(void);
uint8_t TLE9563_enWdInSoftDevMode(void);
uint8_t TLE9563_disWdInSoftDevMode(void);
uint8_t TLE9563_getWdInSoftDevMode(void);
uint8_t TLE9563_enIntnWdFail(void);
uint8_t TLE9563_disIntnWdFail(void);
uint8_t TLE9563_getIntnWdFail(void);
uint8_t TLE9563_enIntnSpiFailOrCrcFail(void);
uint8_t TLE9563_disIntnSpiFailOrCrcFail(void);
uint8_t TLE9563_getIntnSpiFailOrCrcFail(void);
uint8_t TLE9563_enIntnBdrvStat(void);
uint8_t TLE9563_disIntnBdrvStat(void);
uint8_t TLE9563_getIntnBdrvStat(void);
uint8_t TLE9563_enIntnHsStat(void);
uint8_t TLE9563_disIntnHsStat(void);
uint8_t TLE9563_getIntnHsStat(void);
uint8_t TLE9563_enIntnBusStat(void);
uint8_t TLE9563_disIntnBusStat(void);
uint8_t TLE9563_getIntnBusStat(void);
uint8_t TLE9563_enIntnTempStat(void);
uint8_t TLE9563_disIntnTempStat(void);
uint8_t TLE9563_getIntnTempStat(void);
uint8_t TLE9563_enIntnSupplyStat(void);
uint8_t TLE9563_disIntnSupplyStat(void);
uint8_t TLE9563_getIntnSupplyStat(void);
uint16_t TLE9563_getPwm1CtrlReg(void);
uint8_t TLE9563_setPwm1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setPwm1Freq(tPWM_freq e_value);
uint16_t TLE9563_getPwm1Freq(void);
uint8_t TLE9563_setPwm1DutyCycle(uint16_t u16_value);
uint16_t TLE9563_getPwm1DutyCycle(void);
uint16_t TLE9563_getPwm2CtrlReg(void);
uint8_t TLE9563_setPwm2CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setPwm2Freq(tPWM_freq e_value);
uint16_t TLE9563_getPwm2Freq(void);
uint8_t TLE9563_setPwm2DutyCycle(uint16_t u16_value);
uint16_t TLE9563_getPwm2DutyCycle(void);
uint16_t TLE9563_getPwm3CtrlReg(void);
uint8_t TLE9563_setPwm3CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setPwm3Freq(tPWM_freq e_value);
uint16_t TLE9563_getPwm3Freq(void);
uint8_t TLE9563_setPwm3DutyCycle(uint16_t u16_value);
uint16_t TLE9563_getPwm3DutyCycle(void);
uint16_t TLE9563_getPwm4CtrlReg(void);
uint8_t TLE9563_setPwm4CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setPwm4Freq(tPWM_freq e_value);
uint16_t TLE9563_getPwm4Freq(void);
uint8_t TLE9563_setPwm4DutyCycle(uint16_t u16_value);
uint16_t TLE9563_getPwm4DutyCycle(void);
uint8_t TLE9563_setSysStatCtrl(uint16_t u16_value);
uint16_t TLE9563_getSysStatCtrl(void);
uint16_t TLE9563_getGenBridgeCtrlReg(void);
uint8_t TLE9563_setGenBridgeCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvFreq(tBDRV_freq e_value);
uint16_t TLE9563_getBdrvFreq(void);
uint8_t TLE9563_setCpUnderVoltThresh(tCP_underVoltThresh e_value);
uint16_t TLE9563_getCpUnderVoltThresh(void);
uint8_t TLE9563_setBdrvExtMosfetLvl(tBDRV_extMosfetLvl e_value);
uint16_t TLE9563_getBdrvExtMosfetLvl(void);
uint8_t TLE9563_enCpAutoSwitchBetweenDualAndSingleStage(void);
uint8_t TLE9563_disCpAutoSwitchBetweenDualAndSingleStage(void);
uint8_t TLE9563_getCpAutoSwitchBetweenDualAndSingleStage(void);
uint8_t TLE9563_enBdrvVsVsintOverVoltRecovery(void);
uint8_t TLE9563_disBdrvVsVsintOverVoltRecovery(void);
uint8_t TLE9563_getBdrvVsVsintOverVoltRecovery(void);
uint8_t TLE9563_setBdrvPreChargePreDischargeCurAdaption(tBDRV_preChargePreDischargeCurAdaption e_value);
uint16_t TLE9563_getBdrvPreChargePreDischargeCurAdaption(void);
uint8_t TLE9563_setBdrvAdaptGateCtrl(tBDRV_adaptGateCtrl e_value);
uint16_t TLE9563_getBdrvAdaptGateCtrl(void);
uint8_t TLE9563_enCp(void);
uint8_t TLE9563_disCp(void);
uint8_t TLE9563_getCp(void);
uint8_t TLE9563_enBdrvPostCharge(void);
uint8_t TLE9563_disBdrvPostCharge(void);
uint8_t TLE9563_getBdrvPostCharge(void);
uint8_t TLE9563_enBdrvAdaptGateFilt(void);
uint8_t TLE9563_disBdrvAdaptGateFilt(void);
uint8_t TLE9563_getBdrvAdaptGateFilt(void);
uint8_t TLE9563_enBdrvDetectGeneratorMode(void);
uint8_t TLE9563_disBdrvDetectGeneratorMode(void);
uint8_t TLE9563_getBdrvDetectGeneratorMode(void);
uint8_t TLE9563_setBdrvHoldCur(tBDRV_holdCur e_value);
uint16_t TLE9563_getBdrvHoldCur(void);
uint8_t TLE9563_enCpFreqMod(void);
uint8_t TLE9563_disCpFreqMod(void);
uint8_t TLE9563_getCpFreqMod(void);
uint16_t TLE9563_getCsaCtrlReg(void);
uint8_t TLE9563_setCsaCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvNumberOfPwmInputs(tBDRV_numberOfPwmInputs e_value);
uint16_t TLE9563_getBdrvNumberOfPwmInputs(void);
uint8_t TLE9563_setCsaCap(tCSA_cap e_value);
uint16_t TLE9563_getCsaCap(void);
uint8_t TLE9563_setCsaDir(tCSA_dir e_value);
uint16_t TLE9563_getCsaDir(void);
uint8_t TLE9563_setCsaOverCurFiltTime(tCSA_overCurFiltTime e_value);
uint16_t TLE9563_getCsaOverCurFiltTime(void);
uint8_t TLE9563_enCsa(void);
uint8_t TLE9563_disCsa(void);
uint8_t TLE9563_getCsa(void);
uint8_t TLE9563_setCsaOverCurThresh(tCSA_overCurThresh e_value);
uint16_t TLE9563_getCsaOverCurThresh(void);
uint8_t TLE9563_setCsaGain(tCSA_gain e_value);
uint16_t TLE9563_getCsaGain(void);
uint8_t TLE9563_enCsaOverCurShutDown(void);
uint8_t TLE9563_disCsaOverCurShutDown(void);
uint8_t TLE9563_getCsaOverCurShutDown(void);
uint16_t TLE9563_getVdsLsCtrlReg(void);
uint8_t TLE9563_setVdsLsCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setVdsFiltTime(tVDS_filtTime e_value);
uint16_t TLE9563_getVdsFiltTime(void);
uint8_t TLE9563_setVdsLs3OverVoltThresh(tVDS_lsOverVoltThresh e_value);
uint16_t TLE9563_getVdsLs3OverVoltThresh(void);
uint8_t TLE9563_setVdsLs2OverVoltThresh(tVDS_lsOverVoltThresh e_value);
uint16_t TLE9563_getVdsLs2OverVoltThresh(void);
uint8_t TLE9563_setVdsLs1OverVoltThresh(tVDS_lsOverVoltThresh e_value);
uint16_t TLE9563_getVdsLs1OverVoltThresh(void);
uint16_t TLE9563_getVdsHsCtrlReg(void);
uint8_t TLE9563_setVdsHsCtrlReg(uint16_t u16_value);
uint8_t TLE9563_enBdrvDeepAdapt(void);
uint8_t TLE9563_disBdrvDeepAdapt(void);
uint8_t TLE9563_getBdrvDeepAdapt(void);
uint8_t TLE9563_setVdsHs3OverVoltThresh(tVDS_hsOverVoltThresh e_value);
uint16_t TLE9563_getVdsHs3OverVoltThresh(void);
uint8_t TLE9563_setVdsHs2OverVoltThresh(tVDS_hsOverVoltThresh e_value);
uint16_t TLE9563_getVdsHs2OverVoltThresh(void);
uint8_t TLE9563_setVdsHs1OverVoltThresh(tVDS_hsOverVoltThresh e_value);
uint16_t TLE9563_getVdsHs1OverVoltThresh(void);
uint16_t TLE9563_getCcpBlankHb1ActCtrlReg(void);
uint8_t TLE9563_setCcpBlankHb1ActCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1ActTblank(tBDRV_tBlank e_value);
uint16_t TLE9563_getBdrvHb1ActTblank(void);
uint8_t TLE9563_setBdrvHb1ActTccp(tBDRV_tCcp e_value);
uint16_t TLE9563_getBdrvHb1ActTccp(void);
uint16_t TLE9563_getCcpBlankHb2ActCtrlReg(void);
uint8_t TLE9563_setCcpBlankHb2ActCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2ActTblank(tBDRV_tBlank e_value);
uint16_t TLE9563_getBdrvHb2ActTblank(void);
uint8_t TLE9563_setBdrvHb2ActTccp(tBDRV_tCcp e_value);
uint16_t TLE9563_getBdrvHb2ActTccp(void);
uint16_t TLE9563_getCcpBlankHb3ActCtrlReg(void);
uint8_t TLE9563_setCcpBlankHb3ActCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3ActTblank(tBDRV_tBlank e_value);
uint16_t TLE9563_getBdrvHb3ActTblank(void);
uint8_t TLE9563_setBdrvHb3ActTccp(tBDRV_tCcp e_value);
uint16_t TLE9563_getBdrvHb3ActTccp(void);
uint16_t TLE9563_getCcpBlankHb1FwCtrlReg(void);
uint8_t TLE9563_setCcpBlankHb1FwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1FwTblank(tBDRV_tBlank e_value);
uint16_t TLE9563_getBdrvHb1FwTblank(void);
uint8_t TLE9563_setBdrvHb1FwTccp(tBDRV_tCcp e_value);
uint16_t TLE9563_getBdrvHb1FwTccp(void);
uint16_t TLE9563_getCcpBlankHb2FwCtrlReg(void);
uint8_t TLE9563_setCcpBlankHb2FwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2FwTblank(tBDRV_tBlank e_value);
uint16_t TLE9563_getBdrvHb2FwTblank(void);
uint8_t TLE9563_setBdrvHb2FwTccp(tBDRV_tCcp e_value);
uint16_t TLE9563_getBdrvHb2FwTccp(void);
uint16_t TLE9563_getCcpBlankHb3FwCtrlReg(void);
uint8_t TLE9563_setCcpBlankHb3FwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3FwTblank(tBDRV_tBlank e_value);
uint16_t TLE9563_getBdrvHb3FwTblank(void);
uint8_t TLE9563_setBdrvHb3FwTccp(tBDRV_tCcp e_value);
uint16_t TLE9563_getBdrvHb3FwTccp(void);
uint16_t TLE9563_getHbModeCtrlReg(void);
uint8_t TLE9563_setHbModeCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3Mode(tBDRV_hb3Mode e_value);
uint16_t TLE9563_getBdrvHb3Mode(void);
uint8_t TLE9563_enBdrvHb3ActiveFreeWheeling(void);
uint8_t TLE9563_disBdrvHb3ActiveFreeWheeling(void);
uint8_t TLE9563_getBdrvHb3ActiveFreeWheeling(void);
uint8_t TLE9563_enBdrvHb3PwmMode(void);
uint8_t TLE9563_disBdrvHb3PwmMode(void);
uint8_t TLE9563_getBdrvHb3PwmMode(void);
uint8_t TLE9563_setBdrvHb2Mode(tBDRV_hb2Mode e_value);
uint16_t TLE9563_getBdrvHb2Mode(void);
uint8_t TLE9563_enBdrvHb2ActiveFreeWheeling(void);
uint8_t TLE9563_disBdrvHb2ActiveFreeWheeling(void);
uint8_t TLE9563_getBdrvHb2ActiveFreeWheeling(void);
uint8_t TLE9563_enBdrvHb2PwmMode(void);
uint8_t TLE9563_disBdrvHb2PwmMode(void);
uint8_t TLE9563_getBdrvHb2PwmMode(void);
uint8_t TLE9563_setBdrvHb1Mode(tBDRV_hb1Mode e_value);
uint16_t TLE9563_getBdrvHb1Mode(void);
uint8_t TLE9563_enBdrvHb1ActiveFreeWheeling(void);
uint8_t TLE9563_disBdrvHb1ActiveFreeWheeling(void);
uint8_t TLE9563_getBdrvHb1ActiveFreeWheeling(void);
uint8_t TLE9563_enBdrvHb1PwmMode(void);
uint8_t TLE9563_disBdrvHb1PwmMode(void);
uint8_t TLE9563_getBdrvHb1PwmMode(void);
uint16_t TLE9563_getTpreChgCtrlReg(void);
uint8_t TLE9563_setTpreChgCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3PreChargeTime(tBDRV_preChargeDischargeTime e_value);
uint16_t TLE9563_getBdrvHb3PreChargeTime(void);
uint8_t TLE9563_setBdrvHb2PreChargeTime(tBDRV_preChargeDischargeTime e_value);
uint16_t TLE9563_getBdrvHb2PreChargeTime(void);
uint8_t TLE9563_setBdrvHb1PreChargeTime(tBDRV_preChargeDischargeTime e_value);
uint16_t TLE9563_getBdrvHb1PreChargeTime(void);
uint16_t TLE9563_getTpreDischgCtrlReg(void);
uint8_t TLE9563_setTpreDischgCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3PreDischargeTime(tBDRV_preChargeDischargeTime e_value);
uint16_t TLE9563_getBdrvHb3PreDischargeTime(void);
uint8_t TLE9563_setBdrvHb2PreDischargeTime(tBDRV_preChargeDischargeTime e_value);
uint16_t TLE9563_getBdrvHb2PreDischargeTime(void);
uint8_t TLE9563_setBdrvHb1PreDischargeTime(tBDRV_preChargeDischargeTime e_value);
uint16_t TLE9563_getBdrvHb1PreDischargeTime(void);
uint16_t TLE9563_getStIchgCtrlReg(void);
uint8_t TLE9563_setStIchgCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3StaticChargeDischargeCur(tBDRV_staticChargeDischargeCur e_value);
uint16_t TLE9563_getBdrvHb3StaticChargeDischargeCur(void);
uint8_t TLE9563_setBdrvHb2StaticChargeDischargeCur(tBDRV_staticChargeDischargeCur e_value);
uint16_t TLE9563_getBdrvHb2StaticChargeDischargeCur(void);
uint8_t TLE9563_setBdrvHb1StaticChargeDischargeCur(tBDRV_staticChargeDischargeCur e_value);
uint16_t TLE9563_getBdrvHb1StaticChargeDischargeCur(void);
uint16_t TLE9563_getIchgHb1ActCtrlReg(void);
uint8_t TLE9563_setIchgHb1ActCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1ActDischargeCur(tBDRV_dischargeCur e_value);
uint16_t TLE9563_getBdrvHb1ActDischargeCur(void);
uint8_t TLE9563_setBdrvHb1ActChargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb1ActChargeCur(void);
uint16_t TLE9563_getIchgHb2ActCtrlReg(void);
uint8_t TLE9563_setIchgHb2ActCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2ActDischargeCur(tBDRV_dischargeCur e_value);
uint16_t TLE9563_getBdrvHb2ActDischargeCur(void);
uint8_t TLE9563_setBdrvHb2ActChargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb2ActChargeCur(void);
uint16_t TLE9563_getIchgHb3ActCtrlReg(void);
uint8_t TLE9563_setIchgHb3ActCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3ActDischargeCur(tBDRV_dischargeCur e_value);
uint16_t TLE9563_getBdrvHb3ActDischargeCur(void);
uint8_t TLE9563_setBdrvHb3ActChargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb3ActChargeCur(void);
uint16_t TLE9563_getIchgHb1FwCtrlReg(void);
uint8_t TLE9563_setIchgHb1FwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1FwChargeAndDischargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb1FwChargeAndDischargeCur(void);
uint16_t TLE9563_getIchgHb2FwCtrlReg(void);
uint8_t TLE9563_setIchgHb2FwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2FwChargeAndDischargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb2FwChargeAndDischargeCur(void);
uint16_t TLE9563_getIchgHb3FwCtrlReg(void);
uint8_t TLE9563_setIchgHb3FwCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3FwChargeAndDischargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb3FwChargeAndDischargeCur(void);
uint16_t TLE9563_getIchgMaxCtrlReg(void);
uint8_t TLE9563_setIchgMaxCtrlReg(uint16_t u16_value);
uint8_t TLE9563_enBdrvHb3DiagPullDown(void);
uint8_t TLE9563_disBdrvHb3DiagPullDown(void);
uint8_t TLE9563_getBdrvHb3DiagPullDown(void);
uint8_t TLE9563_enBdrvHb2DiagPullDown(void);
uint8_t TLE9563_disBdrvHb2DiagPullDown(void);
uint8_t TLE9563_getBdrvHb2DiagPullDown(void);
uint8_t TLE9563_enBdrvHb1DiagPullDown(void);
uint8_t TLE9563_disBdrvHb1DiagPullDown(void);
uint8_t TLE9563_getBdrvHb1DiagPullDown(void);
uint8_t TLE9563_setBdrvHb3MaxChargeCur(tBDRV_maxChargeCur e_value);
uint16_t TLE9563_getBdrvHb3MaxChargeCur(void);
uint8_t TLE9563_setBdrvHb2MaxChargeCur(tBDRV_maxChargeCur e_value);
uint16_t TLE9563_getBdrvHb2MaxChargeCur(void);
uint8_t TLE9563_setBdrvHb1MaxChargeCur(tBDRV_maxChargeCur e_value);
uint16_t TLE9563_getBdrvHb1MaxChargeCur(void);
uint16_t TLE9563_getPreChgInitHb1CtrlReg(void);
uint8_t TLE9563_setPreChgInitHb1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1InitPreDischargeCur(tBDRV_dischargeCur e_value);
uint16_t TLE9563_getBdrvHb1InitPreDischargeCur(void);
