jassony/infineon2b6/TLE9563_LLD/inc/TLE9563_FuncLayer.h
uint8_t TLE9563_setBdrvHb1InitPreChargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb1InitPreChargeCur(void);
uint16_t TLE9563_getPreChgInitHb2CtrlReg(void);
uint8_t TLE9563_setPreChgInitHb2CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2InitPreDischargeCur(tBDRV_dischargeCur e_value);
uint16_t TLE9563_getBdrvHb2InitPreDischargeCur(void);
uint8_t TLE9563_setBdrvHb2InitPreChargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb2InitPreChargeCur(void);
uint16_t TLE9563_getPreChgInitHb3CtrlReg(void);
uint8_t TLE9563_setPreChgInitHb3CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3InitPreDischargeCur(tBDRV_dischargeCur e_value);
uint16_t TLE9563_getBdrvHb3InitPreDischargeCur(void);
uint8_t TLE9563_setBdrvHb3InitPreChargeCur(tBDRV_chargeCur e_value);
uint16_t TLE9563_getBdrvHb3InitPreChargeCur(void);
uint16_t TLE9563_getTdonHb1CtrlReg(void);
uint8_t TLE9563_setTdonHb1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1Tdon(tBDRV_tdon e_value);
uint16_t TLE9563_getBdrvHb1Tdon(void);
uint16_t TLE9563_getTdonHb2CtrlReg(void);
uint8_t TLE9563_setTdonHb2CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2Tdon(tBDRV_tdon e_value);
uint16_t TLE9563_getBdrvHb2Tdon(void);
uint16_t TLE9563_getTdonHb3CtrlReg(void);
uint8_t TLE9563_setTdonHb3CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3Tdon(tBDRV_tdon e_value);
uint16_t TLE9563_getBdrvHb3Tdon(void);
uint16_t TLE9563_getTdoffHb1CtrlReg(void);
uint8_t TLE9563_setTdoffHb1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb1Tdoff(tBDRV_tdoff e_value);
uint16_t TLE9563_getBdrvHb1Tdoff(void);
uint16_t TLE9563_getTdoffHb2CtrlReg(void);
uint8_t TLE9563_setTdoffHb2CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb2Tdoff(tBDRV_tdoff e_value);
uint16_t TLE9563_getBdrvHb2Tdoff(void);
uint16_t TLE9563_getTdoffHb3CtrlReg(void);
uint8_t TLE9563_setTdoffHb3CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setBdrvHb3Tdoff(tBDRV_tdoff e_value);
uint16_t TLE9563_getBdrvHb3Tdoff(void);
uint16_t TLE9563_getBrakeCtrlReg(void);
uint8_t TLE9563_setBrakeCtrlReg(uint16_t u16_value);
uint8_t TLE9563_enLs3CtrlInSlamMode(void);
uint8_t TLE9563_disLs3CtrlInSlamMode(void);
uint8_t TLE9563_getLs3CtrlInSlamMode(void);
uint8_t TLE9563_enLs2CtrlInSlamMode(void);
uint8_t TLE9563_disLs2CtrlInSlamMode(void);
uint8_t TLE9563_getLs2CtrlInSlamMode(void);
uint8_t TLE9563_enLs1CtrlInSlamMode(void);
uint8_t TLE9563_disLs1CtrlInSlamMode(void);
uint8_t TLE9563_getLs1CtrlInSlamMode(void);
uint8_t TLE9563_enSlamMode(void);
uint8_t TLE9563_disSlamMode(void);
uint8_t TLE9563_getSlamMode(void);
uint8_t TLE9563_setVdsOverVoltThreshLsBrake(tVDS_overVoltThreshLsBrake e_value);
uint16_t TLE9563_getVdsOverVoltThreshLsBrake(void);
uint8_t TLE9563_setVdsOverVoltBlankTimeBrake(tVDS_overVoltBlankTimeBrake e_value);
uint16_t TLE9563_getVdsOverVoltBlankTimeBrake(void);
uint8_t TLE9563_enParkingBrake(void);
uint8_t TLE9563_disParkingBrake(void);
uint8_t TLE9563_getParkingBrake(void);
uint8_t TLE9563_enOverVoltBrake(void);
uint8_t TLE9563_disOverVoltBrake(void);
uint8_t TLE9563_getOverVoltBrake(void);
uint8_t TLE9563_setVsOverVoltThreshBrake(tVS_overVoltThreshBrake e_value);
uint16_t TLE9563_getVsOverVoltThreshBrake(void);
uint16_t TLE9563_getCanSwkCtrlReg(void);
uint8_t TLE9563_setCanSwkCtrlReg(uint16_t u16_value);
uint8_t TLE9563_enCanSwkOscCalMode(void);
uint8_t TLE9563_disCanSwkOscCalMode(void);
uint8_t TLE9563_getCanSwkOscCalMode(void);
uint8_t TLE9563_enCanSwkOscRecalLock(void);
uint8_t TLE9563_disCanSwkOscRecalLock(void);
uint8_t TLE9563_getCanSwkOscRecalLock(void);
uint8_t TLE9563_enCanSwkTimeOutMask(void);
uint8_t TLE9563_disCanSwkTimeOutMask(void);
uint8_t TLE9563_getCanSwkTimeOutMask(void);
uint8_t TLE9563_enCanSwkConfigValid(void);
uint8_t TLE9563_disCanSwkConfigValid(void);
uint8_t TLE9563_getCanSwkConfigValid(void);
uint16_t TLE9563_getSwkBtl1CtrlReg(void);
uint8_t TLE9563_setSwkBtl1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkSamplingPointPos(uint8_t u8_value);
uint16_t TLE9563_getSwkSamplingPointPos(void);
uint8_t TLE9563_setSwkNbTimeQuanta(uint8_t u8_value);
uint16_t TLE9563_getSwkNbTimeQuanta(void);
uint16_t TLE9563_getSwkId1CtrlReg(void);
uint8_t TLE9563_setSwkId1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkIdBit28(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit28(void);
uint8_t TLE9563_setSwkIdBit27(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit27(void);
uint8_t TLE9563_setSwkIdBit26(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit26(void);
uint8_t TLE9563_setSwkIdBit25(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit25(void);
uint8_t TLE9563_setSwkIdBit24(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit24(void);
uint8_t TLE9563_setSwkIdBit23(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit23(void);
uint8_t TLE9563_setSwkIdBit22(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit22(void);
uint8_t TLE9563_setSwkIdBit21(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit21(void);
uint8_t TLE9563_setSwkIdBit20(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit20(void);
uint8_t TLE9563_setSwkIdBit19(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit19(void);
uint8_t TLE9563_setSwkIdBit18(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit18(void);
uint8_t TLE9563_setSwkIdBit17(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit17(void);
uint8_t TLE9563_setSwkIdBit16(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit16(void);
uint8_t TLE9563_setSwkIdBit15(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit15(void);
uint8_t TLE9563_setSwkIdBit14(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit14(void);
uint8_t TLE9563_setSwkIdBit13(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit13(void);
uint16_t TLE9563_getSwkId0CtrlReg(void);
uint8_t TLE9563_setSwkId0CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkIdBit12(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit12(void);
uint8_t TLE9563_setSwkIdBit11(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit11(void);
uint8_t TLE9563_setSwkIdBit10(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit10(void);
uint8_t TLE9563_setSwkIdBit9(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit9(void);
uint8_t TLE9563_setSwkIdBit8(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit8(void);
uint8_t TLE9563_setSwkIdBit7(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit7(void);
uint8_t TLE9563_setSwkIdBit6(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit6(void);
uint8_t TLE9563_setSwkIdBit5(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit5(void);
uint8_t TLE9563_setSwkIdBit4(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit4(void);
uint8_t TLE9563_setSwkIdBit3(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit3(void);
uint8_t TLE9563_setSwkIdBit2(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit2(void);
uint8_t TLE9563_setSwkIdBit1(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit1(void);
uint8_t TLE9563_setSwkIdBit0(uint8_t u8_value);
uint16_t TLE9563_getSwkIdBit0(void);
uint8_t TLE9563_setSwkRemoteTransReq(tSWK_remoteTransReq e_value);
uint16_t TLE9563_getSwkRemoteTransReq(void);
uint8_t TLE9563_setSwkIdExtBit(tSWK_idExtBit e_value);
uint16_t TLE9563_getSwkIdExtBit(void);
uint16_t TLE9563_getSwkMaskId1CtrlReg(void);
uint8_t TLE9563_setSwkMaskId1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_enSwkIdBit28Mask(void);
uint8_t TLE9563_disSwkIdBit28Mask(void);
uint8_t TLE9563_getSwkIdBit28Mask(void);
uint8_t TLE9563_enSwkIdBit27Mask(void);
uint8_t TLE9563_disSwkIdBit27Mask(void);
uint8_t TLE9563_getSwkIdBit27Mask(void);
uint8_t TLE9563_enSwkIdBit26Mask(void);
uint8_t TLE9563_disSwkIdBit26Mask(void);
uint8_t TLE9563_getSwkIdBit26Mask(void);
uint8_t TLE9563_enSwkIdBit25Mask(void);
uint8_t TLE9563_disSwkIdBit25Mask(void);
uint8_t TLE9563_getSwkIdBit25Mask(void);
uint8_t TLE9563_enSwkIdBit24Mask(void);
uint8_t TLE9563_disSwkIdBit24Mask(void);
uint8_t TLE9563_getSwkIdBit24Mask(void);
uint8_t TLE9563_enSwkIdBit23Mask(void);
uint8_t TLE9563_disSwkIdBit23Mask(void);
uint8_t TLE9563_getSwkIdBit23Mask(void);
uint8_t TLE9563_enSwkIdBit22Mask(void);
uint8_t TLE9563_disSwkIdBit22Mask(void);
uint8_t TLE9563_getSwkIdBit22Mask(void);
uint8_t TLE9563_enSwkIdBit21Mask(void);
uint8_t TLE9563_disSwkIdBit21Mask(void);
uint8_t TLE9563_getSwkIdBit21Mask(void);
uint8_t TLE9563_enSwkIdBit20Mask(void);
uint8_t TLE9563_disSwkIdBit20Mask(void);
uint8_t TLE9563_getSwkIdBit20Mask(void);
uint8_t TLE9563_enSwkIdBit19Mask(void);
uint8_t TLE9563_disSwkIdBit19Mask(void);
uint8_t TLE9563_getSwkIdBit19Mask(void);
uint8_t TLE9563_enSwkIdBit18Mask(void);
uint8_t TLE9563_disSwkIdBit18Mask(void);
uint8_t TLE9563_getSwkIdBit18Mask(void);
uint8_t TLE9563_enSwkIdBit17Mask(void);
uint8_t TLE9563_disSwkIdBit17Mask(void);
uint8_t TLE9563_getSwkIdBit17Mask(void);
uint8_t TLE9563_enSwkIdBit16Mask(void);
uint8_t TLE9563_disSwkIdBit16Mask(void);
uint8_t TLE9563_getSwkIdBit16Mask(void);
uint8_t TLE9563_enSwkIdBit15Mask(void);
uint8_t TLE9563_disSwkIdBit15Mask(void);
uint8_t TLE9563_getSwkIdBit15Mask(void);
uint8_t TLE9563_enSwkIdBit14Mask(void);
uint8_t TLE9563_disSwkIdBit14Mask(void);
uint8_t TLE9563_getSwkIdBit14Mask(void);
uint8_t TLE9563_enSwkIdBit13Mask(void);
uint8_t TLE9563_disSwkIdBit13Mask(void);
uint8_t TLE9563_getSwkIdBit13Mask(void);
uint16_t TLE9563_getSwkMaskId0CtrlReg(void);
uint8_t TLE9563_setSwkMaskId0CtrlReg(uint16_t u16_value);
uint8_t TLE9563_enSwkIdBit12Mask(void);
uint8_t TLE9563_disSwkIdBit12Mask(void);
uint8_t TLE9563_getSwkIdBit12Mask(void);
uint8_t TLE9563_enSwkIdBit11Mask(void);
uint8_t TLE9563_disSwkIdBit11Mask(void);
uint8_t TLE9563_getSwkIdBit11Mask(void);
uint8_t TLE9563_enSwkIdBit10Mask(void);
uint8_t TLE9563_disSwkIdBit10Mask(void);
uint8_t TLE9563_getSwkIdBit10Mask(void);
uint8_t TLE9563_enSwkIdBit9Mask(void);
uint8_t TLE9563_disSwkIdBit9Mask(void);
uint8_t TLE9563_getSwkIdBit9Mask(void);
uint8_t TLE9563_enSwkIdBit8Mask(void);
uint8_t TLE9563_disSwkIdBit8Mask(void);
uint8_t TLE9563_getSwkIdBit8Mask(void);
uint8_t TLE9563_enSwkIdBit7Mask(void);
uint8_t TLE9563_disSwkIdBit7Mask(void);
uint8_t TLE9563_getSwkIdBit7Mask(void);
uint8_t TLE9563_enSwkIdBit6Mask(void);
uint8_t TLE9563_disSwkIdBit6Mask(void);
uint8_t TLE9563_getSwkIdBit6Mask(void);
uint8_t TLE9563_enSwkIdBit5Mask(void);
uint8_t TLE9563_disSwkIdBit5Mask(void);
uint8_t TLE9563_getSwkIdBit5Mask(void);
uint8_t TLE9563_enSwkIdBit4Mask(void);
uint8_t TLE9563_disSwkIdBit4Mask(void);
uint8_t TLE9563_getSwkIdBit4Mask(void);
uint8_t TLE9563_enSwkIdBit3Mask(void);
uint8_t TLE9563_disSwkIdBit3Mask(void);
uint8_t TLE9563_getSwkIdBit3Mask(void);
uint8_t TLE9563_enSwkIdBit2Mask(void);
uint8_t TLE9563_disSwkIdBit2Mask(void);
uint8_t TLE9563_getSwkIdBit2Mask(void);
uint8_t TLE9563_enSwkIdBit1Mask(void);
uint8_t TLE9563_disSwkIdBit1Mask(void);
uint8_t TLE9563_getSwkIdBit1Mask(void);
uint8_t TLE9563_enSwkIdBit0Mask(void);
uint8_t TLE9563_disSwkIdBit0Mask(void);
uint8_t TLE9563_getSwkIdBit0Mask(void);
uint16_t TLE9563_getSwkDataLengthCodeReg(void);
uint8_t TLE9563_setSwkDataLengthCodeReg(uint16_t u16_value);
uint8_t TLE9563_setSwkDataLengthCode(tSWK_dataLengthCode e_value);
uint16_t TLE9563_getSwkDataLengthCode(void);
uint16_t TLE9563_getSwkData3CtrlReg(void);
uint8_t TLE9563_setSwkData3CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkContentData7(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData7(void);
uint8_t TLE9563_setSwkContentData6(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData6(void);
uint16_t TLE9563_getSwkData2CtrlReg(void);
uint8_t TLE9563_setSwkData2CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkContentData5(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData5(void);
uint8_t TLE9563_setSwkContentData4(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData4(void);
uint16_t TLE9563_getSwkData1CtrlReg(void);
uint8_t TLE9563_setSwkData1CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkContentData3(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData3(void);
uint8_t TLE9563_setSwkContentData2(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData2(void);
uint16_t TLE9563_getSwkData0CtrlReg(void);
uint8_t TLE9563_setSwkData0CtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkContentData1(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData1(void);
uint8_t TLE9563_setSwkContentData0(uint8_t u8_value);
uint16_t TLE9563_getSwkContentData0(void);
uint16_t TLE9563_getSwkCanFdCtrlReg(void);
uint8_t TLE9563_setSwkCanFdCtrlReg(uint16_t u16_value);
uint8_t TLE9563_enSwkCanFdErrorCount(void);
uint8_t TLE9563_disSwkCanFdErrorCount(void);
uint8_t TLE9563_getSwkCanFdErrorCount(void);
uint8_t TLE9563_setCanFdDomFiltTime(tCANFD_domFiltTime e_value);
uint16_t TLE9563_getCanFdDomFiltTime(void);
uint8_t TLE9563_enCanFdTolerantMode(void);
uint8_t TLE9563_disCanFdTolerantMode(void);
uint8_t TLE9563_getCanFdTolerantMode(void);
uint16_t TLE9563_getSwkOscTrimCtrlReg(void);
uint8_t TLE9563_setSwkOscTrimCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkReceiver(tSWK_receiver e_value);
uint16_t TLE9563_getSwkReceiver(void);
uint8_t TLE9563_setSwkTrimTemp(uint8_t u8_value);
uint16_t TLE9563_getSwkTrimTemp(void);
uint8_t TLE9563_setSwkTrimOsc(uint8_t u8_value);
uint16_t TLE9563_getSwkTrimOsc(void);
uint8_t TLE9563_getSwkOscCalHighRegSts(void);
uint8_t TLE9563_getSwkOscCalLowRegSts(void);
uint16_t TLE9563_getSwkCdrCtrlReg(void);
uint8_t TLE9563_setSwkCdrCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkClockDataRecoveryInputFreq(tSWK_clockDataRecoveryInputFreq e_value);
uint16_t TLE9563_getSwkClockDataRecoveryInputFreq(void);
uint8_t TLE9563_setSwkFiltTimeConst(tSWK_filtTimeConst e_value);
uint16_t TLE9563_getSwkFiltTimeConst(void);
uint8_t TLE9563_enSwkClockDataRecovery(void);
uint8_t TLE9563_disSwkClockDataRecovery(void);
uint8_t TLE9563_getSwkClockDataRecovery(void);
uint16_t TLE9563_getSwkCdrLimitCtrlReg(void);
uint8_t TLE9563_setSwkCdrLimitCtrlReg(uint16_t u16_value);
uint8_t TLE9563_setSwkClockDataRecoveryLimitHigh(uint8_t u8_value);
uint16_t TLE9563_getSwkClockDataRecoveryLimitHigh(void);
uint8_t TLE9563_setSwkClockDataRecoveryLimitLow(uint8_t u8_value);
uint16_t TLE9563_getSwkClockDataRecoveryLimitLow(void);
uint16_t TLE9563_getSupStsReg(void);
uint8_t TLE9563_clrSupSts(void);
uint8_t TLE9563_getPorSts(void);
uint8_t TLE9563_getCpOverTempSts(void);
uint8_t TLE9563_getVcc1UnderVoltFsSts(void);
uint8_t TLE9563_getHsUnderVoltSts(void);
uint8_t TLE9563_getHsOverVoltSts(void);
uint8_t TLE9563_getVsintUnderVoltSts(void);
uint8_t TLE9563_getVsintOverVoltSts(void);
uint8_t TLE9563_getVsUnderVoltSts(void);
uint8_t TLE9563_getVsOverVoltSts(void);
uint8_t TLE9563_getCpUnterVoltSts(void);
uint8_t TLE9563_getVcc1ShortCircuitSts(void);
uint8_t TLE9563_getVcc1UnterVoltSts(void);
uint8_t TLE9563_getVcc1OverVoltSts(void);
uint8_t TLE9563_getVcc1UnderVoltWarnSts(void);
uint16_t TLE9563_getThermStsReg(void);
uint8_t TLE9563_clrThermSts(void);
uint8_t TLE9563_getThermShutDown2SafeStateSts(void);
uint8_t TLE9563_getThermShutDown2Sts(void);
uint8_t TLE9563_getThermShutDown1Sts(void);
uint8_t TLE9563_getThermWarnSts(void);
uint16_t TLE9563_getDevStsReg(void);
uint8_t TLE9563_clrDevSts(void);
uint8_t TLE9563_getCrcSts(void);
uint8_t TLE9563_getCrcFailSts(void);
uint8_t TLE9563_getDeviceSts(void);
uint8_t TLE9563_getOperatingModeSts(void);
uint8_t TLE9563_getWdFailSts(void);
uint8_t TLE9563_getSpiFailSts(void);
uint8_t TLE9563_getFailSts(void);
uint16_t TLE9563_getBusStsReg(void);
uint8_t TLE9563_clrBusSts(void);
uint8_t TLE9563_getCanTimeOutSts(void);
uint8_t TLE9563_getSwkSysErrSts(void);
uint8_t TLE9563_getCanFailSts(void);
uint8_t TLE9563_getVcanUnderVoltSts(void);
uint16_t TLE9563_getWkStsReg(void);
uint8_t TLE9563_clrWkSts(void);
uint8_t TLE9563_getWkCanWuSts(void);
uint8_t TLE9563_getWkTimer2WuSts(void);
uint8_t TLE9563_getWkTimer1WuSts(void);
uint8_t TLE9563_getWk5WuSts(void);
uint8_t TLE9563_getWk4WuSts(void);
uint16_t TLE9563_getWkxLvlStsReg(void);
uint8_t TLE9563_getWk5LvlSts(void);
uint8_t TLE9563_getWk4LvlSts(void);
uint16_t TLE9563_getHsOlOcOtStsReg(void);
uint8_t TLE9563_clrHsOlOcOtSts(void);
uint8_t TLE9563_getHs3OverTempSts(void);
uint8_t TLE9563_getHs2OverTempSts(void);
uint8_t TLE9563_getHs1OverTempSts(void);
uint8_t TLE9563_getHs3OpenLoadSts(void);
uint8_t TLE9563_getHs2OpenLoadSts(void);
uint8_t TLE9563_getHs1OpenLoadSts(void);
uint8_t TLE9563_getHs3OverCurSts(void);
uint8_t TLE9563_getHs2OverCurSts(void);
uint8_t TLE9563_getHs1OverCurSts(void);
uint16_t TLE9563_getGenStsReg(void);
uint8_t TLE9563_getHb3Vsh3VoltLvlSts(void);
uint8_t TLE9563_getHb2Vsh2VoltLvlSts(void);
uint8_t TLE9563_getHb1Vsh1VoltLvlSts(void);
uint8_t TLE9563_getPwm6Sts(void);
uint8_t TLE9563_getPwm5Sts(void);
uint8_t TLE9563_getPwm4Sts(void);
uint8_t TLE9563_getPwm3Sts(void);
uint8_t TLE9563_getPwm2Sts(void);
uint8_t TLE9563_getPwm1Sts(void);
uint16_t TLE9563_getTdregStsReg(void);
uint8_t TLE9563_getHb3PreDischargeCurClampSts(void);
uint8_t TLE9563_getHb2PreDischargeCurClampSts(void);
uint8_t TLE9563_getHb1PreDischargeCurClampSts(void);
uint8_t TLE9563_getHb3PreChargeCurClampSts(void);
uint8_t TLE9563_getHb2PreChargeCurClampSts(void);
uint8_t TLE9563_getHb1PreChargeCurClampSts(void);
uint8_t TLE9563_getHb3TdonTdoffRegSts(void);
uint8_t TLE9563_getHb2TdonTdoffRegSts(void);
uint8_t TLE9563_getHb1TdonTdoffRegSts(void);
uint16_t TLE9563_getDsovStsReg(void);
uint8_t TLE9563_clrDsovSts(void);
uint8_t TLE9563_getCsaOverCurSts(void);
uint8_t TLE9563_getVsintOverVoltBrakeSts(void);
uint8_t TLE9563_getVsOverVoltBrakeSts(void);
uint8_t TLE9563_getVdsOverVoltLs3BrakeSts(void);
uint8_t TLE9563_getVdsOverVoltLs2BrakeSts(void);
uint8_t TLE9563_getVdsOverVoltLs1BrakeSts(void);
uint8_t TLE9563_getVdsOverVoltLs3Sts(void);
uint8_t TLE9563_getVdsOverVoltHs3Sts(void);
uint8_t TLE9563_getVdsOverVoltLs2Sts(void);
uint8_t TLE9563_getVdsOverVoltHs2Sts(void);
uint8_t TLE9563_getVdsOverVoltLs1Sts(void);
uint8_t TLE9563_getVdsOverVoltHs1Sts(void);
uint16_t TLE9563_getEffTdoffTdon1StsReg(void);
uint8_t TLE9563_getBdrvEffTdoff1Sts(void);
uint8_t TLE9563_getBdrvEffTdon1Sts(void);
uint16_t TLE9563_getEffTdoffTdon2StsReg(void);
uint8_t TLE9563_getBdrvEffTdoff2Sts(void);
uint8_t TLE9563_getBdrvEffTdon2Sts(void);
uint16_t TLE9563_getEffTdoffTdon3StsReg(void);
uint8_t TLE9563_getBdrvEffTdoff3Sts(void);
uint8_t TLE9563_getBdrvEffTdon3Sts(void);
uint16_t TLE9563_getEffTfallTrise1StsReg(void);
uint8_t TLE9563_getBdrvEffTfall1Sts(void);
uint8_t TLE9563_getBdrvEffTrise1Sts(void);
uint16_t TLE9563_getEffTfallTrise2StsReg(void);
uint8_t TLE9563_getBdrvEffTfall2Sts(void);
uint8_t TLE9563_getBdrvEffTrise2Sts(void);
uint16_t TLE9563_getEffTfallTrise3StsReg(void);
uint8_t TLE9563_getBdrvEffTfall3Sts(void);
uint8_t TLE9563_getBdrvEffTrise3Sts(void);
uint16_t TLE9563_getSwkStsReg(void);
uint8_t TLE9563_clrSwkSts(void);
uint8_t TLE9563_getSwkSyncSts(void);
uint8_t TLE9563_getSwkWkPatternDetectSts(void);
uint8_t TLE9563_getSwkWkFrameDetectSts(void);
uint8_t TLE9563_getSwkCanSilentTimeSts(void);
uint8_t TLE9563_getSwkActivitySts(void);
uint8_t TLE9563_getSwkCanFrameErrCountSts(void);
uint8_t TLE9563_getSwkClockDataRecoveryOutputSts(void);
uint16_t TLE9563_getFamProdIdStsReg(void);
uint8_t TLE9563_getDeviceFamilyIdSts(void);
uint8_t TLE9563_getDeviceProductIdSts(void);

#endif /* _TLE9563_H */
